[Killed] BlockStatement
src/server.ts:6:50
 import { DomainError, ErrorCode, KeyValueStore } from './store';
 import type { JsonValue, Pair } from './types';
 
-function isJsonValue(v: unknown): v is JsonValue {
-  if (v === null || typeof v === 'boolean' || typeof v === 'number' || typeof v === 'string') return true;
-  if (Array.isArray(v)) return v.every(isJsonValue);
-  if (typeof v === 'object') return Object.values(v as object).every(isJsonValue);
-  return false;
-}
+function isJsonValue(v: unknown): v is JsonValue {}
 
 function asObject(body: unknown): Record<string, unknown> {
killedBy: HTTP API mutation hardening maps domain errors to the correct HTTP statuses
statusReason: expected 413 "Payload Too Large", got 400 "Bad Request"

[Killed] ConditionalExpression
src/server.ts:7:72
 import type { JsonValue, Pair } from './types';
 
 function isJsonValue(v: unknown): v is JsonValue {
-  if (v === null || typeof v === 'boolean' || typeof v === 'number' || typeof v === 'string') return true;
+  if (v === null || typeof v === 'boolean' || typeof v === 'number' || false) return true;
   if (Array.isArray(v)) return v.every(isJsonValue);
   if (typeof v === 'object') return Object.values(v as object).every(isJsonValue);
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] EqualityOperator
src/server.ts:7:47
 import type { JsonValue, Pair } from './types';
 
 function isJsonValue(v: unknown): v is JsonValue {
-  if (v === null || typeof v === 'boolean' || typeof v === 'number' || typeof v === 'string') return true;
+  if (v === null || typeof v === 'boolean' || typeof v !== 'number' || typeof v === 'string') return true;
   if (Array.isArray(v)) return v.every(isJsonValue);
   if (typeof v === 'object') return Object.values(v as object).every(isJsonValue);
killedBy: HTTP API mutation hardening maps domain errors to the correct HTTP statuses
statusReason: expected 507 "Insufficient Storage", got 400 "Bad Request"

[Killed] ConditionalExpression
src/server.ts:8:7
 
 function isJsonValue(v: unknown): v is JsonValue {
   if (v === null || typeof v === 'boolean' || typeof v === 'number' || typeof v === 'string') return true;
-  if (Array.isArray(v)) return v.every(isJsonValue);
+  if (true) return v.every(isJsonValue);
   if (typeof v === 'object') return Object.values(v as object).every(isJsonValue);
   return false;
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 400 "Bad Request"

[Survived] ConditionalExpression
src/server.ts:8:7
 
 function isJsonValue(v: unknown): v is JsonValue {
   if (v === null || typeof v === 'boolean' || typeof v === 'number' || typeof v === 'string') return true;
-  if (Array.isArray(v)) return v.every(isJsonValue);
+  if (false) return v.every(isJsonValue);
   if (typeof v === 'object') return Object.values(v as object).every(isJsonValue);
   return false;

[Killed] EqualityOperator
src/server.ts:9:7
 function isJsonValue(v: unknown): v is JsonValue {
   if (v === null || typeof v === 'boolean' || typeof v === 'number' || typeof v === 'string') return true;
   if (Array.isArray(v)) return v.every(isJsonValue);
-  if (typeof v === 'object') return Object.values(v as object).every(isJsonValue);
+  if (typeof v !== 'object') return Object.values(v as object).every(isJsonValue);
   return false;
 }
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/server.ts:9:7
 function isJsonValue(v: unknown): v is JsonValue {
   if (v === null || typeof v === 'boolean' || typeof v === 'number' || typeof v === 'string') return true;
   if (Array.isArray(v)) return v.every(isJsonValue);
-  if (typeof v === 'object') return Object.values(v as object).every(isJsonValue);
+  if (false) return Object.values(v as object).every(isJsonValue);
   return false;
 }
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 400 "Bad Request"

[NoCoverage] BooleanLiteral
src/server.ts:10:10
   if (v === null || typeof v === 'boolean' || typeof v === 'number' || typeof v === 'string') return true;
   if (Array.isArray(v)) return v.every(isJsonValue);
   if (typeof v === 'object') return Object.values(v as object).every(isJsonValue);
-  return false;
+  return true;
 }
 

[Killed] BlockStatement
src/server.ts:13:59
   return false;
 }
 
-function asObject(body: unknown): Record<string, unknown> {
-  if (body === null || typeof body !== 'object' || Array.isArray(body)) {
-    throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
-  }
-  return body as Record<string, unknown>;
-}
+function asObject(body: unknown): Record<string, unknown> {}
 
 function optionalInt(raw: Record<string, unknown>, key: string): number | undefined {
killedBy: HTTP API mutation hardening rejects a set body without a value field
statusReason: expected 'INVALID_COMMAND' to be 'INVALID_JSON' // Object.is equality

[Killed] EqualityOperator
src/server.ts:14:7
 }
 
 function asObject(body: unknown): Record<string, unknown> {
-  if (body === null || typeof body !== 'object' || Array.isArray(body)) {
+  if (body !== null || typeof body !== 'object' || Array.isArray(body)) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] EqualityOperator
src/server.ts:14:24
 }
 
 function asObject(body: unknown): Record<string, unknown> {
-  if (body === null || typeof body !== 'object' || Array.isArray(body)) {
+  if (body === null || typeof body === 'object' || Array.isArray(body)) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
killedBy: HTTP API mutation hardening maps domain errors to the correct HTTP statuses
statusReason: expected 413 "Payload Too Large", got 400 "Bad Request"

[Killed] BlockStatement
src/server.ts:20:85
   return body as Record<string, unknown>;
 }
 
-function optionalInt(raw: Record<string, unknown>, key: string): number | undefined {
-  if (raw[key] === undefined) return undefined;
-  const n = Number(raw[key]);
-  if (!Number.isInteger(n)) {
-    throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
-  }
-  return n;
-}
+function optionalInt(raw: Record<string, unknown>, key: string): number | undefined {}
 
 function requireInt(raw: Record<string, unknown>, key: string): number {
killedBy: HTTP API mutation hardening rejects non-integer ttlSeconds
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] EqualityOperator
src/server.ts:21:7
 }
 
 function optionalInt(raw: Record<string, unknown>, key: string): number | undefined {
-  if (raw[key] === undefined) return undefined;
+  if (raw[key] !== undefined) return undefined;
   const n = Number(raw[key]);
   if (!Number.isInteger(n)) {
killedBy: HTTP API mutation hardening rejects non-integer ttlSeconds
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] ConditionalExpression
src/server.ts:21:7
 }
 
 function optionalInt(raw: Record<string, unknown>, key: string): number | undefined {
-  if (raw[key] === undefined) return undefined;
+  if (false) return undefined;
   const n = Number(raw[key]);
   if (!Number.isInteger(n)) {
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BooleanLiteral
src/server.ts:23:7
 function optionalInt(raw: Record<string, unknown>, key: string): number | undefined {
   if (raw[key] === undefined) return undefined;
   const n = Number(raw[key]);
-  if (!Number.isInteger(n)) {
+  if (Number.isInteger(n)) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/server.ts:23:7
 function optionalInt(raw: Record<string, unknown>, key: string): number | undefined {
   if (raw[key] === undefined) return undefined;
   const n = Number(raw[key]);
-  if (!Number.isInteger(n)) {
+  if (true) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BlockStatement
src/server.ts:29:72
   return n;
 }
 
-function requireInt(raw: Record<string, unknown>, key: string): number {
-  const n = optionalInt(raw, key);
-  if (n === undefined) {
-    throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
-  }
-  return n;
-}
+function requireInt(raw: Record<string, unknown>, key: string): number {}
 
 function parseSetBody(body: unknown): { value: JsonValue; ttlSeconds?: number } {
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] EqualityOperator
src/server.ts:31:7
 
 function requireInt(raw: Record<string, unknown>, key: string): number {
   const n = optionalInt(raw, key);
-  if (n === undefined) {
+  if (n !== undefined) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/server.ts:31:7
 
 function requireInt(raw: Record<string, unknown>, key: string): number {
   const n = optionalInt(raw, key);
-  if (n === undefined) {
+  if (true) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BlockStatement
src/server.ts:37:81
   return n;
 }
 
-function parseSetBody(body: unknown): { value: JsonValue; ttlSeconds?: number } {
-  const raw = asObject(body);
-  if (!('value' in raw) || !isJsonValue(raw.value)) {
-    throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
-  }
-  return { value: raw.value, ttlSeconds: optionalInt(raw, 'ttlSeconds') };
-}
+function parseSetBody(body: unknown): { value: JsonValue; ttlSeconds?: number } {}
 
 function parseExpireBody(body: unknown): { ttlSeconds: number } {
killedBy: HTTP API mutation hardening rejects a set body without a value field
statusReason: expected 'INVALID_COMMAND' to be 'INVALID_JSON' // Object.is equality

[Killed] ConditionalExpression
src/server.ts:39:7
 
 function parseSetBody(body: unknown): { value: JsonValue; ttlSeconds?: number } {
   const raw = asObject(body);
-  if (!('value' in raw) || !isJsonValue(raw.value)) {
+  if (false) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
killedBy: HTTP API mutation hardening rejects a set body without a value field
statusReason: expected 'INVALID_COMMAND' to be 'INVALID_JSON' // Object.is equality

[Killed] BlockStatement
src/server.ts:39:53
 
 function parseSetBody(body: unknown): { value: JsonValue; ttlSeconds?: number } {
   const raw = asObject(body);
-  if (!('value' in raw) || !isJsonValue(raw.value)) {
-    throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
-  }
+  if (!('value' in raw) || !isJsonValue(raw.value)) {}
   return { value: raw.value, ttlSeconds: optionalInt(raw, 'ttlSeconds') };
 }
killedBy: HTTP API mutation hardening rejects a set body without a value field
statusReason: expected 'INVALID_COMMAND' to be 'INVALID_JSON' // Object.is equality

[Killed] StringLiteral
src/server.ts:42:59
   if (!('value' in raw) || !isJsonValue(raw.value)) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
-  return { value: raw.value, ttlSeconds: optionalInt(raw, 'ttlSeconds') };
+  return { value: raw.value, ttlSeconds: optionalInt(raw, "") };
 }
 
killedBy: HTTP API mutation hardening rejects non-integer ttlSeconds
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] BlockStatement
src/server.ts:45:65
   return { value: raw.value, ttlSeconds: optionalInt(raw, 'ttlSeconds') };
 }
 
-function parseExpireBody(body: unknown): { ttlSeconds: number } {
-  return { ttlSeconds: requireInt(asObject(body), 'ttlSeconds') };
-}
+function parseExpireBody(body: unknown): { ttlSeconds: number } {}
 
 function parseMgetBody(body: unknown): { keys: string[] } {
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] StringLiteral
src/server.ts:46:51
 }
 
 function parseExpireBody(body: unknown): { ttlSeconds: number } {
-  return { ttlSeconds: requireInt(asObject(body), 'ttlSeconds') };
+  return { ttlSeconds: requireInt(asObject(body), "") };
 }
 
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BlockStatement
src/server.ts:49:59
   return { ttlSeconds: requireInt(asObject(body), 'ttlSeconds') };
 }
 
-function parseMgetBody(body: unknown): { keys: string[] } {
-  const raw = asObject(body);
-  if (!Array.isArray(raw.keys) || !raw.keys.every((k) => typeof k === 'string')) {
-    throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
-  }
-  return { keys: raw.keys };
-}
+function parseMgetBody(body: unknown): { keys: string[] } {}
 
 function parseMsetBody(body: unknown): { items: Pair[]; ttlSeconds?: number } {
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/server.ts:51:7
 
 function parseMgetBody(body: unknown): { keys: string[] } {
   const raw = asObject(body);
-  if (!Array.isArray(raw.keys) || !raw.keys.every((k) => typeof k === 'string')) {
+  if (true) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BooleanLiteral
src/server.ts:51:35
 
 function parseMgetBody(body: unknown): { keys: string[] } {
   const raw = asObject(body);
-  if (!Array.isArray(raw.keys) || !raw.keys.every((k) => typeof k === 'string')) {
+  if (!Array.isArray(raw.keys) || raw.keys.every(k => typeof k === 'string')) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ObjectLiteral
src/server.ts:54:10
   if (!Array.isArray(raw.keys) || !raw.keys.every((k) => typeof k === 'string')) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
-  return { keys: raw.keys };
+  return {};
 }
 
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BlockStatement
src/server.ts:57:79
   return { keys: raw.keys };
 }
 
-function parseMsetBody(body: unknown): { items: Pair[]; ttlSeconds?: number } {
-  const raw = asObject(body);
-  if (!Array.isArray(raw.items)) {
-    throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
-  }
-  const items: Pair[] = [];
-  for (const item of raw.items) {
-    if (
-      !item ||
-      typeof item !== 'object' ||
-      typeof (item as Pair).key !== 'string' ||
-      !isJsonValue((item as Pair).value)
-    ) {
-      throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
-    }
-    items.push({ key: (item as Pair).key, value: (item as Pair).value });
-  }
-  return { items, ttlSeconds: optionalInt(raw, 'ttlSeconds') };
-}
+function parseMsetBody(body: unknown): { items: Pair[]; ttlSeconds?: number } {}
 
 export function buildApp(store = new KeyValueStore(), logger = createLogger(process.env.LOG_LEVEL ?? 'info')) {
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/server.ts:59:7
 
 function parseMsetBody(body: unknown): { items: Pair[]; ttlSeconds?: number } {
   const raw = asObject(body);
-  if (!Array.isArray(raw.items)) {
+  if (true) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BooleanLiteral
src/server.ts:59:7
 
 function parseMsetBody(body: unknown): { items: Pair[]; ttlSeconds?: number } {
   const raw = asObject(body);
-  if (!Array.isArray(raw.items)) {
+  if (Array.isArray(raw.items)) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ArrayDeclaration
src/server.ts:62:25
   if (!Array.isArray(raw.items)) {
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
-  const items: Pair[] = [];
+  const items: Pair[] = ["Stryker was here"];
   for (const item of raw.items) {
     if (
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BlockStatement
src/server.ts:63:33
     throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
   }
   const items: Pair[] = [];
-  for (const item of raw.items) {
-    if (
-      !item ||
-      typeof item !== 'object' ||
-      typeof (item as Pair).key !== 'string' ||
-      !isJsonValue((item as Pair).value)
-    ) {
-      throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
-    }
-    items.push({ key: (item as Pair).key, value: (item as Pair).value });
-  }
+  for (const item of raw.items) {}
   return { items, ttlSeconds: optionalInt(raw, 'ttlSeconds') };
 }
killedBy: HTTP API mutation hardening validates mset item shape
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] BooleanLiteral
src/server.ts:65:7
   const items: Pair[] = [];
   for (const item of raw.items) {
     if (
-      !item ||
+      item ||
       typeof item !== 'object' ||
       typeof (item as Pair).key !== 'string' ||
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/server.ts:65:7
   const items: Pair[] = [];
   for (const item of raw.items) {
     if (
-      !item ||
-      typeof item !== 'object' ||
-      typeof (item as Pair).key !== 'string' ||
-      !isJsonValue((item as Pair).value)
+      true
     ) {
       throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] EqualityOperator
src/server.ts:66:7
   for (const item of raw.items) {
     if (
       !item ||
-      typeof item !== 'object' ||
+      typeof item === 'object' ||
       typeof (item as Pair).key !== 'string' ||
       !isJsonValue((item as Pair).value)
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Survived] ConditionalExpression
src/server.ts:66:7
   for (const item of raw.items) {
     if (
       !item ||
-      typeof item !== 'object' ||
+      false ||
       typeof (item as Pair).key !== 'string' ||
       !isJsonValue((item as Pair).value)

[Killed] EqualityOperator
src/server.ts:67:7
     if (
       !item ||
       typeof item !== 'object' ||
-      typeof (item as Pair).key !== 'string' ||
+      typeof (item as Pair).key === 'string' ||
       !isJsonValue((item as Pair).value)
     ) {
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Survived] ConditionalExpression
src/server.ts:67:7
     if (
       !item ||
       typeof item !== 'object' ||
-      typeof (item as Pair).key !== 'string' ||
+      false ||
       !isJsonValue((item as Pair).value)
     ) {

[Killed] BooleanLiteral
src/server.ts:68:7
       !item ||
       typeof item !== 'object' ||
       typeof (item as Pair).key !== 'string' ||
-      !isJsonValue((item as Pair).value)
+      isJsonValue((item as Pair).value)
     ) {
       throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Survived] BlockStatement
src/server.ts:69:7
       typeof item !== 'object' ||
       typeof (item as Pair).key !== 'string' ||
       !isJsonValue((item as Pair).value)
-    ) {
-      throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
-    }
+    ) {}
     items.push({ key: (item as Pair).key, value: (item as Pair).value });
   }

[Survived] StringLiteral
src/server.ts:70:52
       typeof (item as Pair).key !== 'string' ||
       !isJsonValue((item as Pair).value)
     ) {
-      throw new DomainError(ErrorCode.InvalidJson, 'request body must match the API contract');
+      throw new DomainError(ErrorCode.InvalidJson, "");
     }
     items.push({ key: (item as Pair).key, value: (item as Pair).value });

[Killed] ObjectLiteral
src/server.ts:74:10
     }
     items.push({ key: (item as Pair).key, value: (item as Pair).value });
   }
-  return { items, ttlSeconds: optionalInt(raw, 'ttlSeconds') };
+  return {};
 }
 
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] LogicalOperator
src/server.ts:77:77
   return { items, ttlSeconds: optionalInt(raw, 'ttlSeconds') };
 }
 
-export function buildApp(store = new KeyValueStore(), logger = createLogger(process.env.LOG_LEVEL ?? 'info')) {
+export function buildApp(store = new KeyValueStore(), logger = createLogger(process.env.LOG_LEVEL && 'info')) {
   const app = express();
   app.use(express.json({ limit: '2mb' }));
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: expected 400 "Bad Request", got 404 "Not Found"

[Killed] BlockStatement
src/server.ts:80:32
 export function buildApp(store = new KeyValueStore(), logger = createLogger(process.env.LOG_LEVEL ?? 'info')) {
   const app = express();
   app.use(express.json({ limit: '2mb' }));
-  app.use((req, _res, next) => {
-    logger.info({ method: req.method, path: req.path }, 'request');
-    next();
-  });
+  app.use((req, _res, next) => {});
 
   app.get('/health', (_req, res) => ok(res, store.health()));
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/server.ts:85:22
     next();
   });
 
-  app.get('/health', (_req, res) => ok(res, store.health()));
+  app.get('/health', () => undefined);
 
   app.put('/v1/kv/:key', (req, res) => {
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/server.ts:87:40
 
   app.get('/health', (_req, res) => ok(res, store.health()));
 
-  app.put('/v1/kv/:key', (req, res) => {
-    const body = parseSetBody(req.body);
-    ok(res, store.set(req.params.key, body.value, body.ttlSeconds));
-  });
+  app.put('/v1/kv/:key', (req, res) => {});
 
   app.get('/v1/kv/:key', (req, res) => {
killedBy: HTTP API mutation hardening rejects a set body without a value field
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/server.ts:87:11
 
   app.get('/health', (_req, res) => ok(res, store.health()));
 
-  app.put('/v1/kv/:key', (req, res) => {
+  app.put("", (req, res) => {
     const body = parseSetBody(req.body);
     ok(res, store.set(req.params.key, body.value, body.ttlSeconds));
killedBy: HTTP API mutation hardening rejects a set body without a value field
statusReason: expected 'INVALID_COMMAND' to be 'INVALID_JSON' // Object.is equality

[Killed] BlockStatement
src/server.ts:92:40
     ok(res, store.set(req.params.key, body.value, body.ttlSeconds));
   });
 
-  app.get('/v1/kv/:key', (req, res) => {
-    const entry = store.get(req.params.key);
-    if (entry === null) {
-      throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
-    }
-    ok(res, entry);
-  });
+  app.get('/v1/kv/:key', (req, res) => {});
 
   app.delete('/v1/kv/:key', (req, res) => {
killedBy: HTTP API mutation hardening maps domain errors to the correct HTTP statuses
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/server.ts:94:25
 
   app.get('/v1/kv/:key', (req, res) => {
     const entry = store.get(req.params.key);
-    if (entry === null) {
-      throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
-    }
+    if (entry === null) {}
     ok(res, entry);
   });
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected 404 "Not Found", got 200 "OK"

[Killed] ConditionalExpression
src/server.ts:94:9
 
   app.get('/v1/kv/:key', (req, res) => {
     const entry = store.get(req.params.key);
-    if (entry === null) {
+    if (false) {
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
killedBy: HTTP API mutation hardening maps domain errors to the correct HTTP statuses
statusReason: expected 404 "Not Found", got 200 "OK"

[Killed] BlockStatement
src/server.ts:100:43
     ok(res, entry);
   });
 
-  app.delete('/v1/kv/:key', (req, res) => {
-    store.validateKey(req.params.key);
-    ok(res, store.delete([req.params.key]));
-  });
+  app.delete('/v1/kv/:key', (req, res) => {});
 
   app.post('/v1/kv/:key/expire', (req, res) => {
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/server.ts:105:48
     ok(res, store.delete([req.params.key]));
   });
 
-  app.post('/v1/kv/:key/expire', (req, res) => {
-    const body = parseExpireBody(req.body);
-    ok(res, store.expire(req.params.key, body.ttlSeconds));
-  });
+  app.post('/v1/kv/:key/expire', (req, res) => {});
 
   app.get('/v1/kv/:key/ttl', (req, res) => {
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/server.ts:110:44
     ok(res, store.expire(req.params.key, body.ttlSeconds));
   });
 
-  app.get('/v1/kv/:key/ttl', (req, res) => {
-    store.validateKey(req.params.key);
-    ok(res, store.ttl(req.params.key));
-  });
+  app.get('/v1/kv/:key/ttl', (req, res) => {});
 
   app.post('/v1/kv/:key/persist', (req, res) => ok(res, store.persist(req.params.key)));
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/server.ts:110:11
     ok(res, store.expire(req.params.key, body.ttlSeconds));
   });
 
-  app.get('/v1/kv/:key/ttl', (req, res) => {
+  app.get("", (req, res) => {
     store.validateKey(req.params.key);
     ok(res, store.ttl(req.params.key));
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ArrowFunction
src/server.ts:115:35
     ok(res, store.ttl(req.params.key));
   });
 
-  app.post('/v1/kv/:key/persist', (req, res) => ok(res, store.persist(req.params.key)));
+  app.post('/v1/kv/:key/persist', () => undefined);
 
   app.get('/v1/keys', (req, res) => {
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/server.ts:115:12
     ok(res, store.ttl(req.params.key));
   });
 
-  app.post('/v1/kv/:key/persist', (req, res) => ok(res, store.persist(req.params.key)));
+  app.post("", (req, res) => ok(res, store.persist(req.params.key)));
 
   app.get('/v1/keys', (req, res) => {
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: expected 200 "OK", got 400 "Bad Request"
