[Killed] BlockStatement
src/server.ts:117:37
 
   app.post('/v1/kv/:key/persist', (req, res) => ok(res, store.persist(req.params.key)));
 
-  app.get('/v1/keys', (req, res) => {
-    const prefix = typeof req.query.prefix === 'string' ? req.query.prefix : '';
-    const limitRaw = typeof req.query.limit === 'string' ? req.query.limit : undefined;
-    const limit = limitRaw === undefined ? 1000 : Number(limitRaw);
-    if (!Number.isInteger(limit) || limit < 0 || limit > 10_000) {
-      throw new DomainError(ErrorCode.InvalidLimit, 'limit must be between 0 and 10000');
-    }
-    if (Buffer.byteLength(prefix, 'utf8') > 512) {
-      throw new DomainError(ErrorCode.KeyTooLong, 'prefix is too long');
-    }
-    ok(res, store.keys(prefix, limit));
-  });
+  app.get('/v1/keys', (req, res) => {});
 
   app.post('/v1/mget', (req, res) => {
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/server.ts:117:11
 
   app.post('/v1/kv/:key/persist', (req, res) => ok(res, store.persist(req.params.key)));
 
-  app.get('/v1/keys', (req, res) => {
+  app.get("", (req, res) => {
     const prefix = typeof req.query.prefix === 'string' ? req.query.prefix : '';
     const limitRaw = typeof req.query.limit === 'string' ? req.query.limit : undefined;
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: expected 'INVALID_COMMAND' to be 'INVALID_LIMIT' // Object.is equality

[Killed] EqualityOperator
src/server.ts:118:20
   app.post('/v1/kv/:key/persist', (req, res) => ok(res, store.persist(req.params.key)));
 
   app.get('/v1/keys', (req, res) => {
-    const prefix = typeof req.query.prefix === 'string' ? req.query.prefix : '';
+    const prefix = typeof req.query.prefix !== 'string' ? req.query.prefix : '';
     const limitRaw = typeof req.query.limit === 'string' ? req.query.limit : undefined;
     const limit = limitRaw === undefined ? 1000 : Number(limitRaw);
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/server.ts:118:20
   app.post('/v1/kv/:key/persist', (req, res) => ok(res, store.persist(req.params.key)));
 
   app.get('/v1/keys', (req, res) => {
-    const prefix = typeof req.query.prefix === 'string' ? req.query.prefix : '';
+    const prefix = true ? req.query.prefix : '';
     const limitRaw = typeof req.query.limit === 'string' ? req.query.limit : undefined;
     const limit = limitRaw === undefined ? 1000 : Number(limitRaw);
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/server.ts:119:22
 
   app.get('/v1/keys', (req, res) => {
     const prefix = typeof req.query.prefix === 'string' ? req.query.prefix : '';
-    const limitRaw = typeof req.query.limit === 'string' ? req.query.limit : undefined;
+    const limitRaw = false ? req.query.limit : undefined;
     const limit = limitRaw === undefined ? 1000 : Number(limitRaw);
     if (!Number.isInteger(limit) || limit < 0 || limit > 10_000) {
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] EqualityOperator
src/server.ts:119:22
 
   app.get('/v1/keys', (req, res) => {
     const prefix = typeof req.query.prefix === 'string' ? req.query.prefix : '';
-    const limitRaw = typeof req.query.limit === 'string' ? req.query.limit : undefined;
+    const limitRaw = typeof req.query.limit !== 'string' ? req.query.limit : undefined;
     const limit = limitRaw === undefined ? 1000 : Number(limitRaw);
     if (!Number.isInteger(limit) || limit < 0 || limit > 10_000) {
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] EqualityOperator
src/server.ts:120:19
   app.get('/v1/keys', (req, res) => {
     const prefix = typeof req.query.prefix === 'string' ? req.query.prefix : '';
     const limitRaw = typeof req.query.limit === 'string' ? req.query.limit : undefined;
-    const limit = limitRaw === undefined ? 1000 : Number(limitRaw);
+    const limit = limitRaw !== undefined ? 1000 : Number(limitRaw);
     if (!Number.isInteger(limit) || limit < 0 || limit > 10_000) {
       throw new DomainError(ErrorCode.InvalidLimit, 'limit must be between 0 and 10000');
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] ConditionalExpression
src/server.ts:120:19
   app.get('/v1/keys', (req, res) => {
     const prefix = typeof req.query.prefix === 'string' ? req.query.prefix : '';
     const limitRaw = typeof req.query.limit === 'string' ? req.query.limit : undefined;
-    const limit = limitRaw === undefined ? 1000 : Number(limitRaw);
+    const limit = true ? 1000 : Number(limitRaw);
     if (!Number.isInteger(limit) || limit < 0 || limit > 10_000) {
       throw new DomainError(ErrorCode.InvalidLimit, 'limit must be between 0 and 10000');
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] LogicalOperator
src/server.ts:121:9
     const prefix = typeof req.query.prefix === 'string' ? req.query.prefix : '';
     const limitRaw = typeof req.query.limit === 'string' ? req.query.limit : undefined;
     const limit = limitRaw === undefined ? 1000 : Number(limitRaw);
-    if (!Number.isInteger(limit) || limit < 0 || limit > 10_000) {
+    if ((!Number.isInteger(limit) || limit < 0) && limit > 10_000) {
       throw new DomainError(ErrorCode.InvalidLimit, 'limit must be between 0 and 10000');
     }
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] ConditionalExpression
src/server.ts:121:50
     const prefix = typeof req.query.prefix === 'string' ? req.query.prefix : '';
     const limitRaw = typeof req.query.limit === 'string' ? req.query.limit : undefined;
     const limit = limitRaw === undefined ? 1000 : Number(limitRaw);
-    if (!Number.isInteger(limit) || limit < 0 || limit > 10_000) {
+    if (!Number.isInteger(limit) || limit < 0 || false) {
       throw new DomainError(ErrorCode.InvalidLimit, 'limit must be between 0 and 10000');
     }
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: expected 400 "Bad Request", got 200 "OK"

[Survived] StringLiteral
src/server.ts:122:53
     const limitRaw = typeof req.query.limit === 'string' ? req.query.limit : undefined;
     const limit = limitRaw === undefined ? 1000 : Number(limitRaw);
     if (!Number.isInteger(limit) || limit < 0 || limit > 10_000) {
-      throw new DomainError(ErrorCode.InvalidLimit, 'limit must be between 0 and 10000');
+      throw new DomainError(ErrorCode.InvalidLimit, "");
     }
     if (Buffer.byteLength(prefix, 'utf8') > 512) {

[Killed] BlockStatement
src/server.ts:124:50
     if (!Number.isInteger(limit) || limit < 0 || limit > 10_000) {
       throw new DomainError(ErrorCode.InvalidLimit, 'limit must be between 0 and 10000');
     }
-    if (Buffer.byteLength(prefix, 'utf8') > 512) {
-      throw new DomainError(ErrorCode.KeyTooLong, 'prefix is too long');
-    }
+    if (Buffer.byteLength(prefix, 'utf8') > 512) {}
     ok(res, store.keys(prefix, limit));
   });
killedBy: HTTP API mutation hardening rejects an over-long keys prefix
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] EqualityOperator
src/server.ts:124:9
     if (!Number.isInteger(limit) || limit < 0 || limit > 10_000) {
       throw new DomainError(ErrorCode.InvalidLimit, 'limit must be between 0 and 10000');
     }
-    if (Buffer.byteLength(prefix, 'utf8') > 512) {
+    if (Buffer.byteLength(prefix, 'utf8') <= 512) {
       throw new DomainError(ErrorCode.KeyTooLong, 'prefix is too long');
     }
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: expected 200 "OK", got 400 "Bad Request"

[Survived] StringLiteral
src/server.ts:125:51
       throw new DomainError(ErrorCode.InvalidLimit, 'limit must be between 0 and 10000');
     }
     if (Buffer.byteLength(prefix, 'utf8') > 512) {
-      throw new DomainError(ErrorCode.KeyTooLong, 'prefix is too long');
+      throw new DomainError(ErrorCode.KeyTooLong, "");
     }
     ok(res, store.keys(prefix, limit));

[Killed] BlockStatement
src/server.ts:130:38
     ok(res, store.keys(prefix, limit));
   });
 
-  app.post('/v1/mget', (req, res) => {
-    const body = parseMgetBody(req.body);
-    body.keys.forEach((key) => store.validateKey(key));
-    ok(res, store.mget(body.keys));
-  });
+  app.post('/v1/mget', (req, res) => {});
 
   app.post('/v1/mset', (req, res) => {
killedBy: HTTP API mutation hardening validates mget keys is an array of strings
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ArrowFunction
src/server.ts:132:23
 
   app.post('/v1/mget', (req, res) => {
     const body = parseMgetBody(req.body);
-    body.keys.forEach((key) => store.validateKey(key));
+    body.keys.forEach(() => undefined);
     ok(res, store.mget(body.keys));
   });

[Killed] BlockStatement
src/server.ts:136:38
     ok(res, store.mget(body.keys));
   });
 
-  app.post('/v1/mset', (req, res) => {
-    const body = parseMsetBody(req.body);
-    ok(res, store.mset(body.items, body.ttlSeconds));
-  });
+  app.post('/v1/mset', (req, res) => {});
 
   app.post('/v1/flushdb', (_req, res) => ok(res, store.flushdb()));
killedBy: HTTP API mutation hardening validates mset item shape
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ArrowFunction
src/server.ts:141:27
     ok(res, store.mset(body.items, body.ttlSeconds));
   });
 
-  app.post('/v1/flushdb', (_req, res) => ok(res, store.flushdb()));
+  app.post('/v1/flushdb', () => undefined);
 
   app.use((_req, _res) => {

[Survived] StringLiteral
src/server.ts:141:12
     ok(res, store.mset(body.items, body.ttlSeconds));
   });
 
-  app.post('/v1/flushdb', (_req, res) => ok(res, store.flushdb()));
+  app.post("", (_req, res) => ok(res, store.flushdb()));
 
   app.use((_req, _res) => {

[Killed] BlockStatement
src/server.ts:143:27
 
   app.post('/v1/flushdb', (_req, res) => ok(res, store.flushdb()));
 
-  app.use((_req, _res) => {
-    throw new DomainError(ErrorCode.InvalidCommand, 'unsupported route');
-  });
+  app.use((_req, _res) => {});
 
   const errorHandler: ErrorRequestHandler = (error: unknown, _req: Request, res: Response, _next) => {
killedBy: HTTP API mutation hardening returns INVALID_COMMAND for unsupported routes
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/server.ts:147:102
     throw new DomainError(ErrorCode.InvalidCommand, 'unsupported route');
   });
 
-  const errorHandler: ErrorRequestHandler = (error: unknown, _req: Request, res: Response, _next) => {
-    const domainError = toDomainError(error);
-    res
-      .status(statusFor(domainError.code))
-      .json({ ok: false, error: { code: domainError.code, message: domainError.message, details: {} } });
-  };
+  const errorHandler: ErrorRequestHandler = (error: unknown, _req: Request, res: Response, _next) => {};
   app.use(errorHandler);
   return app;
killedBy: HTTP API mutation hardening rejects a set body without a value field
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/server.ts:151:19
     const domainError = toDomainError(error);
     res
       .status(statusFor(domainError.code))
-      .json({ ok: false, error: { code: domainError.code, message: domainError.message, details: {} } });
+      .json({ ok: true, error: { code: domainError.code, message: domainError.message, details: {} } });
   };
   app.use(errorHandler);
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/server.ts:157:49
   return app;
 }
 
-function ok(res: Response, data: unknown): void {
-  res.json({ ok: true, data });
-}
+function ok(res: Response, data: unknown): void {}
 
 function toDomainError(error: unknown): DomainError {
killedBy: HTTP API mutation hardening validates the keys limit range
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/server.ts:158:18
 }
 
 function ok(res: Response, data: unknown): void {
-  res.json({ ok: true, data });
+  res.json({ ok: false, data });
 }
 
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/server.ts:158:12
 }
 
 function ok(res: Response, data: unknown): void {
-  res.json({ ok: true, data });
+  res.json({});
 }
 
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: Cannot read properties of undefined (reading 'ttlSeconds')

[Killed] BlockStatement
src/server.ts:161:53
   res.json({ ok: true, data });
 }
 
-function toDomainError(error: unknown): DomainError {
-  if (error instanceof DomainError) return error;
-  if (error instanceof SyntaxError) {
-    return new DomainError(ErrorCode.InvalidJson, 'request body must be valid JSON');
-  }
-  return new DomainError(ErrorCode.InvalidCommand, 'invalid command');
-}
+function toDomainError(error: unknown): DomainError {}
 
 function statusFor(code: ErrorCode): number {
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected 404 "Not Found", got 500 "Internal Server Error"

[Killed] ConditionalExpression
src/server.ts:162:7
 }
 
 function toDomainError(error: unknown): DomainError {
-  if (error instanceof DomainError) return error;
+  if (false) return error;
   if (error instanceof SyntaxError) {
     return new DomainError(ErrorCode.InvalidJson, 'request body must be valid JSON');
killedBy: HTTP API mutation hardening rejects a set body without a value field
statusReason: expected 'INVALID_COMMAND' to be 'INVALID_JSON' // Object.is equality

[Killed] ConditionalExpression
src/server.ts:162:7
 }
 
 function toDomainError(error: unknown): DomainError {
-  if (error instanceof DomainError) return error;
+  if (true) return error;
   if (error instanceof SyntaxError) {
     return new DomainError(ErrorCode.InvalidJson, 'request body must be valid JSON');
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected undefined to be 'INVALID_JSON' // Object.is equality

[Killed] ConditionalExpression
src/server.ts:163:7
 
 function toDomainError(error: unknown): DomainError {
   if (error instanceof DomainError) return error;
-  if (error instanceof SyntaxError) {
+  if (false) {
     return new DomainError(ErrorCode.InvalidJson, 'request body must be valid JSON');
   }
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected 'INVALID_COMMAND' to be 'INVALID_JSON' // Object.is equality

[Killed] BlockStatement
src/server.ts:163:37
 
 function toDomainError(error: unknown): DomainError {
   if (error instanceof DomainError) return error;
-  if (error instanceof SyntaxError) {
-    return new DomainError(ErrorCode.InvalidJson, 'request body must be valid JSON');
-  }
+  if (error instanceof SyntaxError) {}
   return new DomainError(ErrorCode.InvalidCommand, 'invalid command');
 }
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected 'INVALID_COMMAND' to be 'INVALID_JSON' // Object.is equality

[NoCoverage] StringLiteral
src/server.ts:166:52
   if (error instanceof SyntaxError) {
     return new DomainError(ErrorCode.InvalidJson, 'request body must be valid JSON');
   }
-  return new DomainError(ErrorCode.InvalidCommand, 'invalid command');
+  return new DomainError(ErrorCode.InvalidCommand, "");
 }
 

[Killed] BlockStatement
src/server.ts:169:45
   return new DomainError(ErrorCode.InvalidCommand, 'invalid command');
 }
 
-function statusFor(code: ErrorCode): number {
-  if (code === ErrorCode.KeyNotFound) return 404;
-  if (code === ErrorCode.ValueTooLarge) return 413;
-  if (code === ErrorCode.StoreFull || code === ErrorCode.MemoryLimitExceeded) return 507;
-  return 400;
-}
+function statusFor(code: ErrorCode): number {}
 
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected 404 "Not Found", got 500 "Internal Server Error"

[Killed] ConditionalExpression
src/server.ts:170:7
 }
 
 function statusFor(code: ErrorCode): number {
-  if (code === ErrorCode.KeyNotFound) return 404;
+  if (true) return 404;
   if (code === ErrorCode.ValueTooLarge) return 413;
   if (code === ErrorCode.StoreFull || code === ErrorCode.MemoryLimitExceeded) return 507;
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected 400 "Bad Request", got 404 "Not Found"

[Killed] EqualityOperator
src/server.ts:170:7
 }
 
 function statusFor(code: ErrorCode): number {
-  if (code === ErrorCode.KeyNotFound) return 404;
+  if (code !== ErrorCode.KeyNotFound) return 404;
   if (code === ErrorCode.ValueTooLarge) return 413;
   if (code === ErrorCode.StoreFull || code === ErrorCode.MemoryLimitExceeded) return 507;
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected 404 "Not Found", got 400 "Bad Request"

[Killed] EqualityOperator
src/server.ts:171:7
 
 function statusFor(code: ErrorCode): number {
   if (code === ErrorCode.KeyNotFound) return 404;
-  if (code === ErrorCode.ValueTooLarge) return 413;
+  if (code !== ErrorCode.ValueTooLarge) return 413;
   if (code === ErrorCode.StoreFull || code === ErrorCode.MemoryLimitExceeded) return 507;
   return 400;
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected 400 "Bad Request", got 413 "Payload Too Large"

[Killed] ConditionalExpression
src/server.ts:171:7
 
 function statusFor(code: ErrorCode): number {
   if (code === ErrorCode.KeyNotFound) return 404;
-  if (code === ErrorCode.ValueTooLarge) return 413;
+  if (true) return 413;
   if (code === ErrorCode.StoreFull || code === ErrorCode.MemoryLimitExceeded) return 507;
   return 400;
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected 400 "Bad Request", got 413 "Payload Too Large"

[Killed] EqualityOperator
src/server.ts:172:7
 function statusFor(code: ErrorCode): number {
   if (code === ErrorCode.KeyNotFound) return 404;
   if (code === ErrorCode.ValueTooLarge) return 413;
-  if (code === ErrorCode.StoreFull || code === ErrorCode.MemoryLimitExceeded) return 507;
+  if (code !== ErrorCode.StoreFull || code === ErrorCode.MemoryLimitExceeded) return 507;
   return 400;
 }
killedBy: HTTP API mutation hardening rejects a set body without a value field
statusReason: expected 400 "Bad Request", got 507 "Insufficient Storage"

[Killed] ConditionalExpression
src/server.ts:172:7
 function statusFor(code: ErrorCode): number {
   if (code === ErrorCode.KeyNotFound) return 404;
   if (code === ErrorCode.ValueTooLarge) return 413;
-  if (code === ErrorCode.StoreFull || code === ErrorCode.MemoryLimitExceeded) return 507;
+  if (true) return 507;
   return 400;
 }
killedBy: HTTP API returns deterministic error envelopes
statusReason: expected 400 "Bad Request", got 507 "Insufficient Storage"
