[Killed] ArithmeticOperator
src/store.ts:8:25
 const DEFAULT_MAX_KEYS = 100_000;
 const DEFAULT_MAX_MEMORY_BYTES = 256 << 20;
 const ENTRY_OVERHEAD_BYTES = 64;
-const MAX_TTL_SECONDS = 30 * 24 * 60 * 60;
+const MAX_TTL_SECONDS = 30 / 24 * 60 * 60;
 const NANOS_PER_SECOND = 1_000_000_000n;
 // MINOR-003 (docs/code_review.md): /health used to run a full O(n) removeExpired()
killedBy: KeyValueStore mutation hardening enforces the maximum TTL boundary at exactly 2592000 seconds
statusReason: ttlSeconds must be between 1 and 2592000

[Killed] ArithmeticOperator
src/store.ts:8:25
 const DEFAULT_MAX_KEYS = 100_000;
 const DEFAULT_MAX_MEMORY_BYTES = 256 << 20;
 const ENTRY_OVERHEAD_BYTES = 64;
-const MAX_TTL_SECONDS = 30 * 24 * 60 * 60;
+const MAX_TTL_SECONDS = 30 * 24 / 60 * 60;
 const NANOS_PER_SECOND = 1_000_000_000n;
 // MINOR-003 (docs/code_review.md): /health used to run a full O(n) removeExpired()
killedBy: KeyValueStore mutation hardening enforces the maximum TTL boundary at exactly 2592000 seconds
statusReason: ttlSeconds must be between 1 and 2592000

[Killed] BlockStatement
src/store.ts:77:106
   private expiredKeysRemoved = 0;
   private lastHealthSweepNanos: bigint | null = null;
 
-  constructor(config: StoreConfig = {}, private readonly nowNanos: () => bigint = process.hrtime.bigint) {
-    this.config = {
-      maxKeyBytes: config.maxKeyBytes ?? DEFAULT_MAX_KEY_BYTES,
-      maxValueBytes: config.maxValueBytes ?? DEFAULT_MAX_VALUE_BYTES,
-      maxKeys: config.maxKeys ?? DEFAULT_MAX_KEYS,
-      maxMemoryBytes: config.maxMemoryBytes ?? DEFAULT_MAX_MEMORY_BYTES
-    };
-  }
+  constructor(config: StoreConfig = {}, private readonly nowNanos: () => bigint = process.hrtime.bigint) {}
 
   set(key: string, value: JsonValue, ttlSeconds?: number): { key: string; stored: true; expiresAt?: string } {
killedBy: KeyValueStore sets, gets, replaces ttl, and persists entries
statusReason: Cannot read properties of undefined (reading 'maxKeyBytes')

[Killed] LogicalOperator
src/store.ts:79:20
 
   constructor(config: StoreConfig = {}, private readonly nowNanos: () => bigint = process.hrtime.bigint) {
     this.config = {
-      maxKeyBytes: config.maxKeyBytes ?? DEFAULT_MAX_KEY_BYTES,
+      maxKeyBytes: config.maxKeyBytes && DEFAULT_MAX_KEY_BYTES,
       maxValueBytes: config.maxValueBytes ?? DEFAULT_MAX_VALUE_BYTES,
       maxKeys: config.maxKeys ?? DEFAULT_MAX_KEYS,
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 400 "Bad Request", got 404 "Not Found"

[Killed] LogicalOperator
src/store.ts:80:22
   constructor(config: StoreConfig = {}, private readonly nowNanos: () => bigint = process.hrtime.bigint) {
     this.config = {
       maxKeyBytes: config.maxKeyBytes ?? DEFAULT_MAX_KEY_BYTES,
-      maxValueBytes: config.maxValueBytes ?? DEFAULT_MAX_VALUE_BYTES,
+      maxValueBytes: config.maxValueBytes && DEFAULT_MAX_VALUE_BYTES,
       maxKeys: config.maxKeys ?? DEFAULT_MAX_KEYS,
       maxMemoryBytes: config.maxMemoryBytes ?? DEFAULT_MAX_MEMORY_BYTES
killedBy: HTTP API mutation hardening maps domain errors to the correct HTTP statuses
statusReason: expected 413 "Payload Too Large", got 507 "Insufficient Storage"

[Killed] LogicalOperator
src/store.ts:81:16
     this.config = {
       maxKeyBytes: config.maxKeyBytes ?? DEFAULT_MAX_KEY_BYTES,
       maxValueBytes: config.maxValueBytes ?? DEFAULT_MAX_VALUE_BYTES,
-      maxKeys: config.maxKeys ?? DEFAULT_MAX_KEYS,
+      maxKeys: config.maxKeys && DEFAULT_MAX_KEYS,
       maxMemoryBytes: config.maxMemoryBytes ?? DEFAULT_MAX_MEMORY_BYTES
     };
killedBy: KeyValueStore mutation hardening allows overwriting an existing key at the key limit but rejects a new key
statusReason: expected function to throw STORE_FULL

[Killed] LogicalOperator
src/store.ts:82:23
       maxKeyBytes: config.maxKeyBytes ?? DEFAULT_MAX_KEY_BYTES,
       maxValueBytes: config.maxValueBytes ?? DEFAULT_MAX_VALUE_BYTES,
       maxKeys: config.maxKeys ?? DEFAULT_MAX_KEYS,
-      maxMemoryBytes: config.maxMemoryBytes ?? DEFAULT_MAX_MEMORY_BYTES
+      maxMemoryBytes: config.maxMemoryBytes && DEFAULT_MAX_MEMORY_BYTES
     };
   }
killedBy: KeyValueStore mutation hardening mset rolls back entirely when the batch exceeds the memory limit
statusReason: expected function to throw MEMORY_LIMIT_EXCEEDED

[Killed] BlockStatement
src/store.ts:86:110
     };
   }
 
-  set(key: string, value: JsonValue, ttlSeconds?: number): { key: string; stored: true; expiresAt?: string } {
-    this.commandsProcessed += 1;
-    this.removeExpired(this.nowNanos());
-    const plan = this.validateWrite(key, value, ttlSeconds);
-    const now = this.nowNanos();
-    const existing = this.entries.get(key);
-    this.approxMemoryBytes += plan.approxBytes - (existing?.approxBytes ?? 0);
-    this.entries.set(key, {
-      value: cloneJson(value),
-      createdAtNanos: existing?.createdAtNanos ?? now,
-      updatedAtNanos: now,
-      expiresAtNanos: plan.expiresAtNanos,
-      expiresAtDate: plan.expiresAtDate,
-      approxBytes: plan.approxBytes
-    });
-    return plan.expiresAtDate === null
-      ? { key, stored: true }
-      : { key, stored: true, expiresAt: plan.expiresAtDate.toISOString() };
-  }
+  set(key: string, value: JsonValue, ttlSeconds?: number): { key: string; stored: true; expiresAt?: string } {}
 
   get(key: string): EntryView | null {
killedBy: KeyValueStore mutation hardening enforces the maximum TTL boundary at exactly 2592000 seconds
statusReason: Cannot read properties of undefined (reading 'expiresAt')

[Killed] AssignmentOperator
src/store.ts:87:5
   }
 
   set(key: string, value: JsonValue, ttlSeconds?: number): { key: string; stored: true; expiresAt?: string } {
-    this.commandsProcessed += 1;
+    this.commandsProcessed -= 1;
     this.removeExpired(this.nowNanos());
     const plan = this.validateWrite(key, value, ttlSeconds);
killedBy: KeyValueStore mutation hardening health reports keyCount, memory, and processed commands
statusReason: expected -1 to be greater than or equal to 3

[Killed] AssignmentOperator
src/store.ts:92:5
     const plan = this.validateWrite(key, value, ttlSeconds);
     const now = this.nowNanos();
     const existing = this.entries.get(key);
-    this.approxMemoryBytes += plan.approxBytes - (existing?.approxBytes ?? 0);
+    this.approxMemoryBytes -= plan.approxBytes - (existing?.approxBytes ?? 0);
     this.entries.set(key, {
       value: cloneJson(value),
killedBy: KeyValueStore mutation hardening reclaims memory when overwriting a larger value with a smaller one
statusReason: expected -68 to be less than -167

[Killed] OptionalChaining
src/store.ts:92:51
     const plan = this.validateWrite(key, value, ttlSeconds);
     const now = this.nowNanos();
     const existing = this.entries.get(key);
-    this.approxMemoryBytes += plan.approxBytes - (existing?.approxBytes ?? 0);
+    this.approxMemoryBytes += plan.approxBytes - (existing.approxBytes ?? 0);
     this.entries.set(key, {
       value: cloneJson(value),
killedBy: KeyValueStore mutation hardening enforces the maximum TTL boundary at exactly 2592000 seconds
statusReason: Cannot read properties of undefined (reading 'approxBytes')

[Killed] OptionalChaining
src/store.ts:95:23
     this.approxMemoryBytes += plan.approxBytes - (existing?.approxBytes ?? 0);
     this.entries.set(key, {
       value: cloneJson(value),
-      createdAtNanos: existing?.createdAtNanos ?? now,
+      createdAtNanos: existing.createdAtNanos ?? now,
       updatedAtNanos: now,
       expiresAtNanos: plan.expiresAtNanos,
killedBy: KeyValueStore mutation hardening enforces the maximum TTL boundary at exactly 2592000 seconds
statusReason: Cannot read properties of undefined (reading 'createdAtNanos')

[Survived] LogicalOperator
src/store.ts:95:23
     this.approxMemoryBytes += plan.approxBytes - (existing?.approxBytes ?? 0);
     this.entries.set(key, {
       value: cloneJson(value),
-      createdAtNanos: existing?.createdAtNanos ?? now,
+      createdAtNanos: existing?.createdAtNanos && now,
       updatedAtNanos: now,
       expiresAtNanos: plan.expiresAtNanos,

[Killed] EqualityOperator
src/store.ts:101:12
       expiresAtDate: plan.expiresAtDate,
       approxBytes: plan.approxBytes
     });
-    return plan.expiresAtDate === null
+    return plan.expiresAtDate !== null
       ? { key, stored: true }
       : { key, stored: true, expiresAt: plan.expiresAtDate.toISOString() };
killedBy: KeyValueStore mutation hardening enforces the maximum TTL boundary at exactly 2592000 seconds
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/store.ts:101:12
       expiresAtDate: plan.expiresAtDate,
       approxBytes: plan.approxBytes
     });
-    return plan.expiresAtDate === null
+    return false
       ? { key, stored: true }
       : { key, stored: true, expiresAt: plan.expiresAtDate.toISOString() };
killedBy: KeyValueStore mutation hardening allows overwriting an existing key at the key limit but rejects a new key
statusReason: Cannot read properties of null (reading 'toISOString')

[Killed] BooleanLiteral
src/store.ts:102:24
       approxBytes: plan.approxBytes
     });
     return plan.expiresAtDate === null
-      ? { key, stored: true }
+      ? { key, stored: false }
       : { key, stored: true, expiresAt: plan.expiresAtDate.toISOString() };
   }
killedBy: KeyValueStore mutation hardening allows overwriting an existing key at the key limit but rejects a new key
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/store.ts:102:9
       approxBytes: plan.approxBytes
     });
     return plan.expiresAtDate === null
-      ? { key, stored: true }
+      ? {}
       : { key, stored: true, expiresAt: plan.expiresAtDate.toISOString() };
   }
killedBy: KeyValueStore mutation hardening allows overwriting an existing key at the key limit but rejects a new key
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/store.ts:103:24
     });
     return plan.expiresAtDate === null
       ? { key, stored: true }
-      : { key, stored: true, expiresAt: plan.expiresAtDate.toISOString() };
+      : { key, stored: false, expiresAt: plan.expiresAtDate.toISOString() };
   }
 
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/store.ts:106:38
       : { key, stored: true, expiresAt: plan.expiresAtDate.toISOString() };
   }
 
-  get(key: string): EntryView | null {
-    this.commandsProcessed += 1;
-    const now = this.nowNanos();
-    if (!this.validStoredKey(key, now)) {
-      return null;
-    }
-    const entry = this.entries.get(key);
-    return entry === undefined ? null : this.view(key, entry, now);
-  }
+  get(key: string): EntryView | null {}
 
   delete(keys: readonly string[]): { deleted: number } {
killedBy: KeyValueStore mutation hardening treats a key as expired at the exact expiry instant
statusReason: expected undefined to be null

[Killed] AssignmentOperator
src/store.ts:107:5
   }
 
   get(key: string): EntryView | null {
-    this.commandsProcessed += 1;
+    this.commandsProcessed -= 1;
     const now = this.nowNanos();
     if (!this.validStoredKey(key, now)) {
killedBy: KeyValueStore mutation hardening health reports keyCount, memory, and processed commands
statusReason: expected 1 to be greater than or equal to 3

[Killed] ConditionalExpression
src/store.ts:109:9
   get(key: string): EntryView | null {
     this.commandsProcessed += 1;
     const now = this.nowNanos();
-    if (!this.validStoredKey(key, now)) {
+    if (false) {
       return null;
     }
killedBy: KeyValueStore mutation hardening treats a key as expired at the exact expiry instant
statusReason: expected { key: 'k', value: 'v', …(2) } to be null

[Killed] ConditionalExpression
src/store.ts:109:9
   get(key: string): EntryView | null {
     this.commandsProcessed += 1;
     const now = this.nowNanos();
-    if (!this.validStoredKey(key, now)) {
+    if (true) {
       return null;
     }
killedBy: KeyValueStore mutation hardening allows overwriting an existing key at the key limit but rejects a new key
statusReason: expected undefined to be 2 // Object.is equality

[Killed] EqualityOperator
src/store.ts:113:12
       return null;
     }
     const entry = this.entries.get(key);
-    return entry === undefined ? null : this.view(key, entry, now);
+    return entry !== undefined ? null : this.view(key, entry, now);
   }
 
killedBy: KeyValueStore mutation hardening allows overwriting an existing key at the key limit but rejects a new key
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
src/store.ts:113:12
       return null;
     }
     const entry = this.entries.get(key);
-    return entry === undefined ? null : this.view(key, entry, now);
+    return true ? null : this.view(key, entry, now);
   }
 
killedBy: KeyValueStore mutation hardening allows overwriting an existing key at the key limit but rejects a new key
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/store.ts:116:56
     return entry === undefined ? null : this.view(key, entry, now);
   }
 
-  delete(keys: readonly string[]): { deleted: number } {
-    this.commandsProcessed += 1;
-    const now = this.nowNanos();
-    let deleted = 0;
-    for (const key of keys) {
-      if (this.validStoredKey(key, now)) {
-        this.removeKey(key);
-        deleted += 1;
-      }
-    }
-    return { deleted };
-  }
+  delete(keys: readonly string[]): { deleted: number } {}
 
   expire(key: string, ttlSeconds: number): { updated: boolean; ttlSeconds: number; expiresAt: string } {
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: Cannot read properties of undefined (reading 'deleted')

[Survived] AssignmentOperator
src/store.ts:117:5
   }
 
   delete(keys: readonly string[]): { deleted: number } {
-    this.commandsProcessed += 1;
+    this.commandsProcessed -= 1;
     const now = this.nowNanos();
     let deleted = 0;

[Killed] BlockStatement
src/store.ts:120:29
     this.commandsProcessed += 1;
     const now = this.nowNanos();
     let deleted = 0;
-    for (const key of keys) {
-      if (this.validStoredKey(key, now)) {
-        this.removeKey(key);
-        deleted += 1;
-      }
-    }
+    for (const key of keys) {}
     return { deleted };
   }
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/store.ts:121:42
     const now = this.nowNanos();
     let deleted = 0;
     for (const key of keys) {
-      if (this.validStoredKey(key, now)) {
-        this.removeKey(key);
-        deleted += 1;
-      }
+      if (this.validStoredKey(key, now)) {}
     }
     return { deleted };
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/store.ts:121:11
     const now = this.nowNanos();
     let deleted = 0;
     for (const key of keys) {
-      if (this.validStoredKey(key, now)) {
+      if (true) {
         this.removeKey(key);
         deleted += 1;
killedBy: KeyValueStore hides expired keys and keeps delete idempotent
statusReason: expected 3 to be 1 // Object.is equality

[Killed] AssignmentOperator
src/store.ts:123:9
     for (const key of keys) {
       if (this.validStoredKey(key, now)) {
         this.removeKey(key);
-        deleted += 1;
+        deleted -= 1;
       }
     }
killedBy: HTTP API mutation hardening exposes delete, ttl, and persist over HTTP
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
src/store.ts:129:104
     return { deleted };
   }
 
-  expire(key: string, ttlSeconds: number): { updated: boolean; ttlSeconds: number; expiresAt: string } {
-    this.validateKey(key);
-    validateTtl(ttlSeconds);
-    this.commandsProcessed += 1;
-    const now = this.nowNanos();
-    if (!this.validStoredKey(key, now)) {
-      throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
-    }
-    const entry = this.entries.get(key);
-    if (entry === undefined) {
-      throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
-    }
-    const expiresAtNanos = now + BigInt(ttlSeconds) * NANOS_PER_SECOND;
-    const expiresAtDate = new Date(Date.now() + ttlSeconds * 1000);
-    entry.expiresAtNanos = expiresAtNanos;
-    entry.expiresAtDate = expiresAtDate;
-    entry.updatedAtNanos = now;
-    return { updated: true, ttlSeconds, expiresAt: expiresAtDate.toISOString() };
-  }
+  expire(key: string, ttlSeconds: number): { updated: boolean; ttlSeconds: number; expiresAt: string } {}
 
   ttl(key: string): { ttlSeconds: number } {
killedBy: KeyValueStore rejects invalid keys on expire() with INVALID_KEY/KEY_TOO_LONG, not KEY_NOT_FOUND
statusReason: expected function to throw INVALID_KEY

[Survived] AssignmentOperator
src/store.ts:132:5
   expire(key: string, ttlSeconds: number): { updated: boolean; ttlSeconds: number; expiresAt: string } {
     this.validateKey(key);
     validateTtl(ttlSeconds);
-    this.commandsProcessed += 1;
+    this.commandsProcessed -= 1;
     const now = this.nowNanos();
     if (!this.validStoredKey(key, now)) {

[Killed] BooleanLiteral
src/store.ts:134:9
     validateTtl(ttlSeconds);
     this.commandsProcessed += 1;
     const now = this.nowNanos();
-    if (!this.validStoredKey(key, now)) {
+    if (this.validStoredKey(key, now)) {
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 200 "OK", got 404 "Not Found"

[Survived] StringLiteral
src/store.ts:135:52
     this.commandsProcessed += 1;
     const now = this.nowNanos();
     if (!this.validStoredKey(key, now)) {
-      throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
+      throw new DomainError(ErrorCode.KeyNotFound, "");
     }
     const entry = this.entries.get(key);

[Killed] EqualityOperator
src/store.ts:138:9
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
     const entry = this.entries.get(key);
-    if (entry === undefined) {
+    if (entry !== undefined) {
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 200 "OK", got 404 "Not Found"

[Killed] ConditionalExpression
src/store.ts:138:9
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
     const entry = this.entries.get(key);
-    if (entry === undefined) {
+    if (true) {
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 200 "OK", got 404 "Not Found"

[Survived] ArithmeticOperator
src/store.ts:141:34
     if (entry === undefined) {
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
-    const expiresAtNanos = now + BigInt(ttlSeconds) * NANOS_PER_SECOND;
+    const expiresAtNanos = now + BigInt(ttlSeconds) / NANOS_PER_SECOND;
     const expiresAtDate = new Date(Date.now() + ttlSeconds * 1000);
     entry.expiresAtNanos = expiresAtNanos;

[Survived] ArithmeticOperator
src/store.ts:141:28
     if (entry === undefined) {
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
-    const expiresAtNanos = now + BigInt(ttlSeconds) * NANOS_PER_SECOND;
+    const expiresAtNanos = now - BigInt(ttlSeconds) * NANOS_PER_SECOND;
     const expiresAtDate = new Date(Date.now() + ttlSeconds * 1000);
     entry.expiresAtNanos = expiresAtNanos;

[Survived] ArithmeticOperator
src/store.ts:142:36
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
     const expiresAtNanos = now + BigInt(ttlSeconds) * NANOS_PER_SECOND;
-    const expiresAtDate = new Date(Date.now() + ttlSeconds * 1000);
+    const expiresAtDate = new Date(Date.now() - ttlSeconds * 1000);
     entry.expiresAtNanos = expiresAtNanos;
     entry.expiresAtDate = expiresAtDate;

[Survived] ArithmeticOperator
src/store.ts:142:49
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
     const expiresAtNanos = now + BigInt(ttlSeconds) * NANOS_PER_SECOND;
-    const expiresAtDate = new Date(Date.now() + ttlSeconds * 1000);
+    const expiresAtDate = new Date(Date.now() + ttlSeconds / 1000);
     entry.expiresAtNanos = expiresAtNanos;
     entry.expiresAtDate = expiresAtDate;

[Survived] BooleanLiteral
src/store.ts:146:23
     entry.expiresAtNanos = expiresAtNanos;
     entry.expiresAtDate = expiresAtDate;
     entry.updatedAtNanos = now;
-    return { updated: true, ttlSeconds, expiresAt: expiresAtDate.toISOString() };
+    return { updated: false, ttlSeconds, expiresAt: expiresAtDate.toISOString() };
   }
 

[Survived] ObjectLiteral
src/store.ts:146:12
     entry.expiresAtNanos = expiresAtNanos;
     entry.expiresAtDate = expiresAtDate;
     entry.updatedAtNanos = now;
-    return { updated: true, ttlSeconds, expiresAt: expiresAtDate.toISOString() };
+    return {};
   }
 

[Killed] BlockStatement
src/store.ts:149:44
     return { updated: true, ttlSeconds, expiresAt: expiresAtDate.toISOString() };
   }
 
-  ttl(key: string): { ttlSeconds: number } {
-    this.commandsProcessed += 1;
-    const now = this.nowNanos();
-    if (!this.validStoredKey(key, now)) {
-      return { ttlSeconds: -2 };
-    }
-    const entry = this.entries.get(key);
-    if (entry?.expiresAtNanos === null || entry === undefined) {
-      return { ttlSeconds: -1 };
-    }
-    return { ttlSeconds: remainingSeconds(entry.expiresAtNanos, now) };
-  }
+  ttl(key: string): { ttlSeconds: number } {}
 
   persist(key: string): { updated: boolean } {
killedBy: KeyValueStore mutation hardening treats a key as expired at the exact expiry instant
statusReason: Cannot read properties of undefined (reading 'ttlSeconds')

[Survived] AssignmentOperator
src/store.ts:150:5
   }
 
   ttl(key: string): { ttlSeconds: number } {
-    this.commandsProcessed += 1;
+    this.commandsProcessed -= 1;
     const now = this.nowNanos();
     if (!this.validStoredKey(key, now)) {

[Killed] UnaryOperator
src/store.ts:153:28
     this.commandsProcessed += 1;
     const now = this.nowNanos();
     if (!this.validStoredKey(key, now)) {
-      return { ttlSeconds: -2 };
+      return { ttlSeconds: +2 };
     }
     const entry = this.entries.get(key);
killedBy: KeyValueStore mutation hardening treats a key as expired at the exact expiry instant
statusReason: expected 2 to be -2 // Object.is equality

[Killed] ConditionalExpression
src/store.ts:156:9
       return { ttlSeconds: -2 };
     }
     const entry = this.entries.get(key);
-    if (entry?.expiresAtNanos === null || entry === undefined) {
+    if (false || entry === undefined) {
       return { ttlSeconds: -1 };
     }
killedBy: KeyValueStore sets, gets, replaces ttl, and persists entries
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
src/store.ts:156:9
       return { ttlSeconds: -2 };
     }
     const entry = this.entries.get(key);
-    if (entry?.expiresAtNanos === null || entry === undefined) {
+    if (false) {
       return { ttlSeconds: -1 };
     }
killedBy: KeyValueStore mutation hardening reports ttl -2 for missing, -1 for no-expiry, and a positive value for a live ttl
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] UnaryOperator
src/store.ts:157:28
     }
     const entry = this.entries.get(key);
     if (entry?.expiresAtNanos === null || entry === undefined) {
-      return { ttlSeconds: -1 };
+      return { ttlSeconds: +1 };
     }
     return { ttlSeconds: remainingSeconds(entry.expiresAtNanos, now) };
killedBy: KeyValueStore mutation hardening reports ttl -2 for missing, -1 for no-expiry, and a positive value for a live ttl
statusReason: expected 1 to be -1 // Object.is equality

[Killed] BlockStatement
src/store.ts:162:46
     return { ttlSeconds: remainingSeconds(entry.expiresAtNanos, now) };
   }
 
-  persist(key: string): { updated: boolean } {
-    this.commandsProcessed += 1;
-    const now = this.nowNanos();
-    if (!this.validStoredKey(key, now)) {
-      throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
-    }
-    const entry = this.entries.get(key);
-    if (entry === undefined) {
-      throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
-    }
-    const updated = entry.expiresAtNanos !== null;
-    entry.expiresAtNanos = null;
-    entry.expiresAtDate = null;
-    entry.updatedAtNanos = now;
-    return { updated };
-  }
+  persist(key: string): { updated: boolean } {}
 
   keys(prefix = '', limit = 1000): { keys: string[]; count: number } {
killedBy: KeyValueStore mutation hardening persist returns updated:false for a key that has no expiry
statusReason: Cannot read properties of undefined (reading 'updated')

[Survived] AssignmentOperator
src/store.ts:163:5
   }
 
   persist(key: string): { updated: boolean } {
-    this.commandsProcessed += 1;
+    this.commandsProcessed -= 1;
     const now = this.nowNanos();
     if (!this.validStoredKey(key, now)) {

[Killed] EqualityOperator
src/store.ts:172:21
     if (entry === undefined) {
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
-    const updated = entry.expiresAtNanos !== null;
+    const updated = entry.expiresAtNanos === null;
     entry.expiresAtNanos = null;
     entry.expiresAtDate = null;
killedBy: KeyValueStore mutation hardening persist returns updated:false for a key that has no expiry
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/store.ts:172:21
     if (entry === undefined) {
       throw new DomainError(ErrorCode.KeyNotFound, 'key not found');
     }
-    const updated = entry.expiresAtNanos !== null;
+    const updated = true;
     entry.expiresAtNanos = null;
     entry.expiresAtDate = null;
killedBy: KeyValueStore mutation hardening persist returns updated:false for a key that has no expiry
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/store.ts:179:70
     return { updated };
   }
 
-  keys(prefix = '', limit = 1000): { keys: string[]; count: number } {
-    this.commandsProcessed += 1;
-    this.removeExpired(this.nowNanos());
-    const keys = [...this.entries.keys()].filter((key) => key.startsWith(prefix)).sort().slice(0, limit);
-    return { keys, count: keys.length };
-  }
+  keys(prefix = '', limit = 1000): { keys: string[]; count: number } {}
 
   mget(keys: readonly string[]): { items: Array<{ key: string; value: JsonValue | null; found: boolean }> } {
killedBy: KeyValueStore mutation hardening keys returns sorted results capped by the limit
statusReason: Cannot read properties of undefined (reading 'keys')

[Survived] AssignmentOperator
src/store.ts:180:5
   }
 
   keys(prefix = '', limit = 1000): { keys: string[]; count: number } {
-    this.commandsProcessed += 1;
+    this.commandsProcessed -= 1;
     this.removeExpired(this.nowNanos());
     const keys = [...this.entries.keys()].filter((key) => key.startsWith(prefix)).sort().slice(0, limit);

[Killed] ArrowFunction
src/store.ts:182:50
   keys(prefix = '', limit = 1000): { keys: string[]; count: number } {
     this.commandsProcessed += 1;
     this.removeExpired(this.nowNanos());
-    const keys = [...this.entries.keys()].filter((key) => key.startsWith(prefix)).sort().slice(0, limit);
+    const keys = [...this.entries.keys()].filter(() => undefined).sort().slice(0, limit);
     return { keys, count: keys.length };
   }
killedBy: KeyValueStore mutation hardening keys returns sorted results capped by the limit
statusReason: expected [] to deeply equal [ 'a', 'b', 'c' ]

[Killed] MethodExpression
src/store.ts:182:18
   keys(prefix = '', limit = 1000): { keys: string[]; count: number } {
     this.commandsProcessed += 1;
     this.removeExpired(this.nowNanos());
-    const keys = [...this.entries.keys()].filter((key) => key.startsWith(prefix)).sort().slice(0, limit);
+    const keys = [...this.entries.keys()].filter(key => key.startsWith(prefix)).sort();
     return { keys, count: keys.length };
   }
killedBy: KeyValueStore mutation hardening keys returns sorted results capped by the limit
statusReason: expected [ 'a', 'b', 'c' ] to deeply equal [ 'a', 'b' ]

[Killed] ObjectLiteral
src/store.ts:183:12
     this.commandsProcessed += 1;
     this.removeExpired(this.nowNanos());
     const keys = [...this.entries.keys()].filter((key) => key.startsWith(prefix)).sort().slice(0, limit);
-    return { keys, count: keys.length };
+    return {};
   }
 
killedBy: KeyValueStore mutation hardening keys returns sorted results capped by the limit
statusReason: expected undefined to deeply equal [ 'a', 'b', 'c' ]
