[Killed] BlockStatement
src/store.ts:186:109
     return { keys, count: keys.length };
   }
 
-  mget(keys: readonly string[]): { items: Array<{ key: string; value: JsonValue | null; found: boolean }> } {
-    this.commandsProcessed += 1;
-    const now = this.nowNanos();
-    const items = keys.map((key) => {
-      if (!this.validStoredKey(key, now)) {
-        return { key, value: null, found: false };
-      }
-      const entry = this.entries.get(key);
-      return { key, value: entry === undefined ? null : cloneJson(entry.value), found: entry !== undefined };
-    });
-    return { items };
-  }
+  mget(keys: readonly string[]): { items: Array<{ key: string; value: JsonValue | null; found: boolean }> } {}
 
   mset(items: readonly Pair[], ttlSeconds?: number): { stored: number; expiresAt?: string } {
killedBy: KeyValueStore mutation hardening get and mget return copies so callers cannot mutate stored state
statusReason: Cannot read properties of undefined (reading 'items')

[Survived] AssignmentOperator
src/store.ts:187:5
   }
 
   mget(keys: readonly string[]): { items: Array<{ key: string; value: JsonValue | null; found: boolean }> } {
-    this.commandsProcessed += 1;
+    this.commandsProcessed -= 1;
     const now = this.nowNanos();
     const items = keys.map((key) => {

[Killed] BlockStatement
src/store.ts:189:37
   mget(keys: readonly string[]): { items: Array<{ key: string; value: JsonValue | null; found: boolean }> } {
     this.commandsProcessed += 1;
     const now = this.nowNanos();
-    const items = keys.map((key) => {
-      if (!this.validStoredKey(key, now)) {
-        return { key, value: null, found: false };
-      }
-      const entry = this.entries.get(key);
-      return { key, value: entry === undefined ? null : cloneJson(entry.value), found: entry !== undefined };
-    });
+    const items = keys.map((key) => {});
     return { items };
   }
killedBy: KeyValueStore mutation hardening get and mget return copies so callers cannot mutate stored state
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BooleanLiteral
src/store.ts:190:11
     this.commandsProcessed += 1;
     const now = this.nowNanos();
     const items = keys.map((key) => {
-      if (!this.validStoredKey(key, now)) {
+      if (this.validStoredKey(key, now)) {
         return { key, value: null, found: false };
       }
killedBy: KeyValueStore mutation hardening get and mget return copies so callers cannot mutate stored state
statusReason: Cannot read properties of null (reading 'nested')

[Killed] ConditionalExpression
src/store.ts:190:11
     this.commandsProcessed += 1;
     const now = this.nowNanos();
     const items = keys.map((key) => {
-      if (!this.validStoredKey(key, now)) {
+      if (true) {
         return { key, value: null, found: false };
       }
killedBy: KeyValueStore mutation hardening get and mget return copies so callers cannot mutate stored state
statusReason: Cannot read properties of null (reading 'nested')

[Killed] BooleanLiteral
src/store.ts:191:43
     const now = this.nowNanos();
     const items = keys.map((key) => {
       if (!this.validStoredKey(key, now)) {
-        return { key, value: null, found: false };
+        return { key, value: null, found: true };
       }
       const entry = this.entries.get(key);
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected [ true, true, true ] to deeply equal [ true, false, true ]

[Killed] ObjectLiteral
src/store.ts:191:16
     const now = this.nowNanos();
     const items = keys.map((key) => {
       if (!this.validStoredKey(key, now)) {
-        return { key, value: null, found: false };
+        return {};
       }
       const entry = this.entries.get(key);
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected [ true, undefined, true ] to deeply equal [ true, false, true ]

[Killed] EqualityOperator
src/store.ts:194:88
         return { key, value: null, found: false };
       }
       const entry = this.entries.get(key);
-      return { key, value: entry === undefined ? null : cloneJson(entry.value), found: entry !== undefined };
+      return { key, value: entry === undefined ? null : cloneJson(entry.value), found: entry === undefined };
     });
     return { items };
killedBy: HTTP API mutation hardening round-trips mset and mget over HTTP
statusReason: expected [ false, false ] to deeply equal [ true, true ]

[Killed] EqualityOperator
src/store.ts:194:28
         return { key, value: null, found: false };
       }
       const entry = this.entries.get(key);
-      return { key, value: entry === undefined ? null : cloneJson(entry.value), found: entry !== undefined };
+      return { key, value: entry !== undefined ? null : cloneJson(entry.value), found: entry !== undefined };
     });
     return { items };
killedBy: KeyValueStore mutation hardening get and mget return copies so callers cannot mutate stored state
statusReason: Cannot read properties of null (reading 'nested')

[Survived] AssignmentOperator
src/store.ts:200:5
   }
 
   mset(items: readonly Pair[], ttlSeconds?: number): { stored: number; expiresAt?: string } {
-    this.commandsProcessed += 1;
+    this.commandsProcessed -= 1;
     this.removeExpired(this.nowNanos());
     const seen = new Set<string>();

[Killed] BlockStatement
src/store.ts:206:31
     const plans: WritePlan[] = [];
     let newKeyCount = this.entries.size;
     let newMemory = this.approxMemoryBytes;
-    for (const item of items) {
-      if (seen.has(item.key)) {
-        throw new DomainError(ErrorCode.InvalidKey, 'duplicate key in mset');
-      }
-      seen.add(item.key);
-      const plan = this.validateWrite(item.key, item.value, ttlSeconds);
-      if (!this.entries.has(item.key)) {
-        newKeyCount += 1;
-      }
-      newMemory += plan.approxBytes - (this.entries.get(item.key)?.approxBytes ?? 0);
-      plans.push(plan);
-    }
+    for (const item of items) {}
     if (newKeyCount > this.config.maxKeys) {
       throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
killedBy: KeyValueStore mutation hardening mset over existing keys does not count them toward the key limit
statusReason: expected undefined to be 10 // Object.is equality

[Killed] ConditionalExpression
src/store.ts:207:11
     let newKeyCount = this.entries.size;
     let newMemory = this.approxMemoryBytes;
     for (const item of items) {
-      if (seen.has(item.key)) {
+      if (true) {
         throw new DomainError(ErrorCode.InvalidKey, 'duplicate key in mset');
       }
killedBy: KeyValueStore mutation hardening mset over existing keys does not count them toward the key limit
statusReason: duplicate key in mset

[Killed] ConditionalExpression
src/store.ts:207:11
     let newKeyCount = this.entries.size;
     let newMemory = this.approxMemoryBytes;
     for (const item of items) {
-      if (seen.has(item.key)) {
+      if (false) {
         throw new DomainError(ErrorCode.InvalidKey, 'duplicate key in mset');
       }
killedBy: KeyValueStore validates key, ttl, value size, and duplicate mset keys
statusReason: expected function to throw INVALID_KEY

[Survived] StringLiteral
src/store.ts:208:53
     let newMemory = this.approxMemoryBytes;
     for (const item of items) {
       if (seen.has(item.key)) {
-        throw new DomainError(ErrorCode.InvalidKey, 'duplicate key in mset');
+        throw new DomainError(ErrorCode.InvalidKey, "");
       }
       seen.add(item.key);

[Killed] ConditionalExpression
src/store.ts:212:11
       }
       seen.add(item.key);
       const plan = this.validateWrite(item.key, item.value, ttlSeconds);
-      if (!this.entries.has(item.key)) {
+      if (true) {
         newKeyCount += 1;
       }
killedBy: KeyValueStore mutation hardening mset over existing keys does not count them toward the key limit
statusReason: store key limit exceeded

[Killed] BooleanLiteral
src/store.ts:212:11
       }
       seen.add(item.key);
       const plan = this.validateWrite(item.key, item.value, ttlSeconds);
-      if (!this.entries.has(item.key)) {
+      if (this.entries.has(item.key)) {
         newKeyCount += 1;
       }
killedBy: KeyValueStore mutation hardening mset over existing keys does not count them toward the key limit
statusReason: store key limit exceeded

[Survived] AssignmentOperator
src/store.ts:213:9
       seen.add(item.key);
       const plan = this.validateWrite(item.key, item.value, ttlSeconds);
       if (!this.entries.has(item.key)) {
-        newKeyCount += 1;
+        newKeyCount -= 1;
       }
       newMemory += plan.approxBytes - (this.entries.get(item.key)?.approxBytes ?? 0);

[Killed] LogicalOperator
src/store.ts:215:40
       if (!this.entries.has(item.key)) {
         newKeyCount += 1;
       }
-      newMemory += plan.approxBytes - (this.entries.get(item.key)?.approxBytes ?? 0);
+      newMemory += plan.approxBytes - (this.entries.get(item.key)?.approxBytes && 0);
       plans.push(plan);
     }
killedBy: KeyValueStore mutation hardening mset rolls back entirely when the batch exceeds the memory limit
statusReason: expected function to throw MEMORY_LIMIT_EXCEEDED

[Killed] AssignmentOperator
src/store.ts:215:7
       if (!this.entries.has(item.key)) {
         newKeyCount += 1;
       }
-      newMemory += plan.approxBytes - (this.entries.get(item.key)?.approxBytes ?? 0);
+      newMemory -= plan.approxBytes - (this.entries.get(item.key)?.approxBytes ?? 0);
       plans.push(plan);
     }
killedBy: KeyValueStore mutation hardening mset rolls back entirely when the batch exceeds the memory limit
statusReason: expected function to throw MEMORY_LIMIT_EXCEEDED

[Killed] EqualityOperator
src/store.ts:218:9
       newMemory += plan.approxBytes - (this.entries.get(item.key)?.approxBytes ?? 0);
       plans.push(plan);
     }
-    if (newKeyCount > this.config.maxKeys) {
+    if (newKeyCount >= this.config.maxKeys) {
       throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
     }
killedBy: KeyValueStore mutation hardening mset over existing keys does not count them toward the key limit
statusReason: store key limit exceeded

[Killed] ConditionalExpression
src/store.ts:218:9
       newMemory += plan.approxBytes - (this.entries.get(item.key)?.approxBytes ?? 0);
       plans.push(plan);
     }
-    if (newKeyCount > this.config.maxKeys) {
+    if (true) {
       throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
     }
killedBy: KeyValueStore mutation hardening mset over existing keys does not count them toward the key limit
statusReason: store key limit exceeded

[NoCoverage] StringLiteral
src/store.ts:219:50
       plans.push(plan);
     }
     if (newKeyCount > this.config.maxKeys) {
-      throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
+      throw new DomainError(ErrorCode.StoreFull, "");
     }
     if (newMemory > this.config.maxMemoryBytes) {

[Killed] ConditionalExpression
src/store.ts:221:9
     if (newKeyCount > this.config.maxKeys) {
       throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
     }
-    if (newMemory > this.config.maxMemoryBytes) {
+    if (false) {
       throw new DomainError(ErrorCode.MemoryLimitExceeded, 'memory limit exceeded');
     }
killedBy: KeyValueStore mutation hardening mset rolls back entirely when the batch exceeds the memory limit
statusReason: expected function to throw MEMORY_LIMIT_EXCEEDED

[Killed] BlockStatement
src/store.ts:221:49
     if (newKeyCount > this.config.maxKeys) {
       throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
     }
-    if (newMemory > this.config.maxMemoryBytes) {
-      throw new DomainError(ErrorCode.MemoryLimitExceeded, 'memory limit exceeded');
-    }
+    if (newMemory > this.config.maxMemoryBytes) {}
     const now = this.nowNanos();
     items.forEach((item, index) => {
killedBy: KeyValueStore mutation hardening mset rolls back entirely when the batch exceeds the memory limit
statusReason: expected function to throw MEMORY_LIMIT_EXCEEDED

[Killed] BlockStatement
src/store.ts:225:36
       throw new DomainError(ErrorCode.MemoryLimitExceeded, 'memory limit exceeded');
     }
     const now = this.nowNanos();
-    items.forEach((item, index) => {
-      const existing = this.entries.get(item.key);
-      const plan = plans[index];
-      if (plan === undefined) {
-        return;
-      }
-      this.entries.set(item.key, {
-        value: cloneJson(item.value),
-        createdAtNanos: existing?.createdAtNanos ?? now,
-        updatedAtNanos: now,
-        expiresAtNanos: plan.expiresAtNanos,
-        expiresAtDate: plan.expiresAtDate,
-        approxBytes: plan.approxBytes
-      });
-    });
+    items.forEach((item, index) => {});
     this.approxMemoryBytes = newMemory;
     const expiresAt = plans.find((plan) => plan.expiresAtDate !== null)?.expiresAtDate?.toISOString();
killedBy: KeyValueStore mutation hardening mset over existing keys does not count them toward the key limit
statusReason: expected undefined to be 10 // Object.is equality

[Killed] ConditionalExpression
src/store.ts:228:11
     items.forEach((item, index) => {
       const existing = this.entries.get(item.key);
       const plan = plans[index];
-      if (plan === undefined) {
+      if (true) {
         return;
       }
killedBy: KeyValueStore mutation hardening mset over existing keys does not count them toward the key limit
statusReason: expected undefined to be 10 // Object.is equality

[Killed] EqualityOperator
src/store.ts:228:11
     items.forEach((item, index) => {
       const existing = this.entries.get(item.key);
       const plan = plans[index];
-      if (plan === undefined) {
+      if (plan !== undefined) {
         return;
       }
killedBy: KeyValueStore mutation hardening mset over existing keys does not count them toward the key limit
statusReason: expected undefined to be 10 // Object.is equality

[Killed] OptionalChaining
src/store.ts:233:25
       }
       this.entries.set(item.key, {
         value: cloneJson(item.value),
-        createdAtNanos: existing?.createdAtNanos ?? now,
+        createdAtNanos: existing.createdAtNanos ?? now,
         updatedAtNanos: now,
         expiresAtNanos: plan.expiresAtNanos,
killedBy: KeyValueStore mutation hardening mset over existing keys does not count them toward the key limit
statusReason: Cannot read properties of undefined (reading 'createdAtNanos')

[Survived] LogicalOperator
src/store.ts:233:25
       }
       this.entries.set(item.key, {
         value: cloneJson(item.value),
-        createdAtNanos: existing?.createdAtNanos ?? now,
+        createdAtNanos: existing?.createdAtNanos && now,
         updatedAtNanos: now,
         expiresAtNanos: plan.expiresAtNanos,

[Killed] OptionalChaining
src/store.ts:241:23
       });
     });
     this.approxMemoryBytes = newMemory;
-    const expiresAt = plans.find((plan) => plan.expiresAtDate !== null)?.expiresAtDate?.toISOString();
+    const expiresAt = plans.find(plan => plan.expiresAtDate !== null).expiresAtDate?.toISOString();
     return expiresAt === undefined ? { stored: items.length } : { stored: items.length, expiresAt };
   }
killedBy: KeyValueStore mutation hardening mset over existing keys does not count them toward the key limit
statusReason: Cannot read properties of undefined (reading 'expiresAtDate')

[Survived] EqualityOperator
src/store.ts:241:44
       });
     });
     this.approxMemoryBytes = newMemory;
-    const expiresAt = plans.find((plan) => plan.expiresAtDate !== null)?.expiresAtDate?.toISOString();
+    const expiresAt = plans.find((plan) => plan.expiresAtDate === null)?.expiresAtDate?.toISOString();
     return expiresAt === undefined ? { stored: items.length } : { stored: items.length, expiresAt };
   }

[Survived] ConditionalExpression
src/store.ts:242:12
     });
     this.approxMemoryBytes = newMemory;
     const expiresAt = plans.find((plan) => plan.expiresAtDate !== null)?.expiresAtDate?.toISOString();
-    return expiresAt === undefined ? { stored: items.length } : { stored: items.length, expiresAt };
+    return false ? { stored: items.length } : { stored: items.length, expiresAt };
   }
 

[Survived] EqualityOperator
src/store.ts:242:12
     });
     this.approxMemoryBytes = newMemory;
     const expiresAt = plans.find((plan) => plan.expiresAtDate !== null)?.expiresAtDate?.toISOString();
-    return expiresAt === undefined ? { stored: items.length } : { stored: items.length, expiresAt };
+    return expiresAt !== undefined ? { stored: items.length } : { stored: items.length, expiresAt };
   }
 

[Killed] BlockStatement
src/store.ts:245:34
     return expiresAt === undefined ? { stored: items.length } : { stored: items.length, expiresAt };
   }
 
-  flushdb(): { deleted: number } {
-    this.commandsProcessed += 1;
-    const deleted = this.entries.size;
-    this.entries.clear();
-    this.approxMemoryBytes = 0;
-    return { deleted };
-  }
+  flushdb(): { deleted: number } {}
 
   health(): { status: 'ok'; keyCount: number; approxMemoryBytes: number; commandsProcessed: number; expiredKeysRemoved: number } {
killedBy: KeyValueStore msets atomically, mgets in order, and flushes
statusReason: Cannot read properties of undefined (reading 'deleted')

[Survived] AssignmentOperator
src/store.ts:246:5
   }
 
   flushdb(): { deleted: number } {
-    this.commandsProcessed += 1;
+    this.commandsProcessed -= 1;
     const deleted = this.entries.size;
     this.entries.clear();

[Killed] ObjectLiteral
src/store.ts:250:12
     const deleted = this.entries.size;
     this.entries.clear();
     this.approxMemoryBytes = 0;
-    return { deleted };
+    return {};
   }
 
killedBy: KeyValueStore msets atomically, mgets in order, and flushes
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/store.ts:253:130
     return { deleted };
   }
 
-  health(): { status: 'ok'; keyCount: number; approxMemoryBytes: number; commandsProcessed: number; expiredKeysRemoved: number } {
-    const now = this.nowNanos();
-    if (this.lastHealthSweepNanos === null || now - this.lastHealthSweepNanos >= HEALTH_SWEEP_MIN_INTERVAL_NANOS) {
-      this.removeExpired(now);
-      this.lastHealthSweepNanos = now;
-    }
-    return {
-      status: 'ok',
-      keyCount: this.entries.size,
-      approxMemoryBytes: this.approxMemoryBytes,
-      commandsProcessed: this.commandsProcessed,
-      expiredKeysRemoved: this.expiredKeysRemoved
-    };
-  }
+  health(): { status: 'ok'; keyCount: number; approxMemoryBytes: number; commandsProcessed: number; expiredKeysRemoved: number } {}
 
   validateKey(key: string): void {
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] EqualityOperator
src/store.ts:255:9
 
   health(): { status: 'ok'; keyCount: number; approxMemoryBytes: number; commandsProcessed: number; expiredKeysRemoved: number } {
     const now = this.nowNanos();
-    if (this.lastHealthSweepNanos === null || now - this.lastHealthSweepNanos >= HEALTH_SWEEP_MIN_INTERVAL_NANOS) {
+    if (this.lastHealthSweepNanos !== null || now - this.lastHealthSweepNanos >= HEALTH_SWEEP_MIN_INTERVAL_NANOS) {
       this.removeExpired(now);
       this.lastHealthSweepNanos = now;
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] ConditionalExpression
src/store.ts:255:47
 
   health(): { status: 'ok'; keyCount: number; approxMemoryBytes: number; commandsProcessed: number; expiredKeysRemoved: number } {
     const now = this.nowNanos();
-    if (this.lastHealthSweepNanos === null || now - this.lastHealthSweepNanos >= HEALTH_SWEEP_MIN_INTERVAL_NANOS) {
+    if (this.lastHealthSweepNanos === null || false) {
       this.removeExpired(now);
       this.lastHealthSweepNanos = now;
killedBy: KeyValueStore health() rate-limits its expired-key sweep but still converges to accurate counts
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/store.ts:259:12
       this.removeExpired(now);
       this.lastHealthSweepNanos = now;
     }
-    return {
-      status: 'ok',
-      keyCount: this.entries.size,
-      approxMemoryBytes: this.approxMemoryBytes,
-      commandsProcessed: this.commandsProcessed,
-      expiredKeysRemoved: this.expiredKeysRemoved
-    };
+    return {};
   }
 
killedBy: KeyValueStore mutation hardening reclaims memory when overwriting a larger value with a smaller one
statusReason: actual value must be number or bigint, received "undefined"

[Killed] StringLiteral
src/store.ts:260:15
       this.lastHealthSweepNanos = now;
     }
     return {
-      status: 'ok',
+      status: "",
       keyCount: this.entries.size,
       approxMemoryBytes: this.approxMemoryBytes,
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected '' to be 'ok' // Object.is equality

[Killed] BlockStatement
src/store.ts:268:34
     };
   }
 
-  validateKey(key: string): void {
-    if (key.length === 0) {
-      throw new DomainError(ErrorCode.InvalidKey, 'key must be non-empty');
-    }
-    if (Buffer.byteLength(key, 'utf8') > this.config.maxKeyBytes) {
-      throw new DomainError(ErrorCode.KeyTooLong, 'key is too long');
-    }
-  }
+  validateKey(key: string): void {}
 
   private validateWrite(key: string, value: JsonValue, ttlSeconds?: number): WritePlan {
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 400 "Bad Request", got 404 "Not Found"

[Killed] EqualityOperator
src/store.ts:269:9
   }
 
   validateKey(key: string): void {
-    if (key.length === 0) {
+    if (key.length !== 0) {
       throw new DomainError(ErrorCode.InvalidKey, 'key must be non-empty');
     }
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BlockStatement
src/store.ts:269:27
   }
 
   validateKey(key: string): void {
-    if (key.length === 0) {
-      throw new DomainError(ErrorCode.InvalidKey, 'key must be non-empty');
-    }
+    if (key.length === 0) {}
     if (Buffer.byteLength(key, 'utf8') > this.config.maxKeyBytes) {
       throw new DomainError(ErrorCode.KeyTooLong, 'key is too long');
killedBy: KeyValueStore validates key, ttl, value size, and duplicate mset keys
statusReason: expected function to throw INVALID_KEY

[Killed] BlockStatement
src/store.ts:272:67
     if (key.length === 0) {
       throw new DomainError(ErrorCode.InvalidKey, 'key must be non-empty');
     }
-    if (Buffer.byteLength(key, 'utf8') > this.config.maxKeyBytes) {
-      throw new DomainError(ErrorCode.KeyTooLong, 'key is too long');
-    }
+    if (Buffer.byteLength(key, 'utf8') > this.config.maxKeyBytes) {}
   }
 
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 400 "Bad Request", got 404 "Not Found"

[Killed] EqualityOperator
src/store.ts:272:9
     if (key.length === 0) {
       throw new DomainError(ErrorCode.InvalidKey, 'key must be non-empty');
     }
-    if (Buffer.byteLength(key, 'utf8') > this.config.maxKeyBytes) {
+    if (Buffer.byteLength(key, 'utf8') <= this.config.maxKeyBytes) {
       throw new DomainError(ErrorCode.KeyTooLong, 'key is too long');
     }
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BlockStatement
src/store.ts:279:35
 
   private validateWrite(key: string, value: JsonValue, ttlSeconds?: number): WritePlan {
     this.validateKey(key);
-    if (ttlSeconds !== undefined) {
-      validateTtl(ttlSeconds);
-    }
+    if (ttlSeconds !== undefined) {}
     const serialized = JSON.stringify(value);
     const serializedBytes = Buffer.byteLength(serialized, 'utf8');
killedBy: KeyValueStore mutation hardening enforces the maximum TTL boundary at exactly 2592000 seconds
statusReason: expected function to throw INVALID_TTL

[Killed] EqualityOperator
src/store.ts:279:9
 
   private validateWrite(key: string, value: JsonValue, ttlSeconds?: number): WritePlan {
     this.validateKey(key);
-    if (ttlSeconds !== undefined) {
+    if (ttlSeconds === undefined) {
       validateTtl(ttlSeconds);
     }
killedBy: KeyValueStore sets, gets, replaces ttl, and persists entries
statusReason: ttlSeconds must be between 1 and 2592000

[Killed] EqualityOperator
src/store.ts:284:9
     }
     const serialized = JSON.stringify(value);
     const serializedBytes = Buffer.byteLength(serialized, 'utf8');
-    if (serializedBytes > this.config.maxValueBytes) {
+    if (serializedBytes <= this.config.maxValueBytes) {
       throw new DomainError(ErrorCode.ValueTooLarge, 'value is too large');
     }
killedBy: KeyValueStore sets, gets, replaces ttl, and persists entries
statusReason: value is too large

[Killed] ConditionalExpression
src/store.ts:284:9
     }
     const serialized = JSON.stringify(value);
     const serializedBytes = Buffer.byteLength(serialized, 'utf8');
-    if (serializedBytes > this.config.maxValueBytes) {
+    if (true) {
       throw new DomainError(ErrorCode.ValueTooLarge, 'value is too large');
     }
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 413 "Payload Too Large"

[Killed] BooleanLiteral
src/store.ts:287:9
     if (serializedBytes > this.config.maxValueBytes) {
       throw new DomainError(ErrorCode.ValueTooLarge, 'value is too large');
     }
-    if (!this.entries.has(key) && this.entries.size >= this.config.maxKeys) {
+    if (this.entries.has(key) && this.entries.size >= this.config.maxKeys) {
       throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
     }
killedBy: KeyValueStore mutation hardening allows overwriting an existing key at the key limit but rejects a new key
statusReason: store key limit exceeded

[Killed] ConditionalExpression
src/store.ts:287:9
     if (serializedBytes > this.config.maxValueBytes) {
       throw new DomainError(ErrorCode.ValueTooLarge, 'value is too large');
     }
-    if (!this.entries.has(key) && this.entries.size >= this.config.maxKeys) {
+    if (true) {
       throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
     }
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 507 "Insufficient Storage"

[Survived] StringLiteral
src/store.ts:288:50
       throw new DomainError(ErrorCode.ValueTooLarge, 'value is too large');
     }
     if (!this.entries.has(key) && this.entries.size >= this.config.maxKeys) {
-      throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
+      throw new DomainError(ErrorCode.StoreFull, "");
     }
     const approxBytes = Buffer.byteLength(key, 'utf8') + serializedBytes + ENTRY_OVERHEAD_BYTES;

[Killed] ArithmeticOperator
src/store.ts:290:25
     if (!this.entries.has(key) && this.entries.size >= this.config.maxKeys) {
       throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
     }
-    const approxBytes = Buffer.byteLength(key, 'utf8') + serializedBytes + ENTRY_OVERHEAD_BYTES;
+    const approxBytes = Buffer.byteLength(key, 'utf8') - serializedBytes + ENTRY_OVERHEAD_BYTES;
     const oldBytes = this.entries.get(key)?.approxBytes ?? 0;
     if (this.approxMemoryBytes + approxBytes - oldBytes > this.config.maxMemoryBytes) {
killedBy: KeyValueStore mutation hardening reclaims memory when overwriting a larger value with a smaller one
statusReason: expected 62 to be less than -37

[Killed] ArithmeticOperator
src/store.ts:290:25
     if (!this.entries.has(key) && this.entries.size >= this.config.maxKeys) {
       throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
     }
-    const approxBytes = Buffer.byteLength(key, 'utf8') + serializedBytes + ENTRY_OVERHEAD_BYTES;
+    const approxBytes = Buffer.byteLength(key, 'utf8') + serializedBytes - ENTRY_OVERHEAD_BYTES;
     const oldBytes = this.entries.get(key)?.approxBytes ?? 0;
     if (this.approxMemoryBytes + approxBytes - oldBytes > this.config.maxMemoryBytes) {
killedBy: KeyValueStore mutation hardening mset rolls back entirely when the batch exceeds the memory limit
statusReason: expected function to throw MEMORY_LIMIT_EXCEEDED

[Killed] OptionalChaining
src/store.ts:291:22
       throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
     }
     const approxBytes = Buffer.byteLength(key, 'utf8') + serializedBytes + ENTRY_OVERHEAD_BYTES;
-    const oldBytes = this.entries.get(key)?.approxBytes ?? 0;
+    const oldBytes = this.entries.get(key).approxBytes ?? 0;
     if (this.approxMemoryBytes + approxBytes - oldBytes > this.config.maxMemoryBytes) {
       throw new DomainError(ErrorCode.MemoryLimitExceeded, 'memory limit exceeded');
killedBy: KeyValueStore mutation hardening enforces the maximum TTL boundary at exactly 2592000 seconds
statusReason: Cannot read properties of undefined (reading 'approxBytes')

[Killed] LogicalOperator
src/store.ts:291:22
       throw new DomainError(ErrorCode.StoreFull, 'store key limit exceeded');
     }
     const approxBytes = Buffer.byteLength(key, 'utf8') + serializedBytes + ENTRY_OVERHEAD_BYTES;
-    const oldBytes = this.entries.get(key)?.approxBytes ?? 0;
+    const oldBytes = this.entries.get(key)?.approxBytes && 0;
     if (this.approxMemoryBytes + approxBytes - oldBytes > this.config.maxMemoryBytes) {
       throw new DomainError(ErrorCode.MemoryLimitExceeded, 'memory limit exceeded');
killedBy: KeyValueStore mutation hardening subtracts replaced bytes when checking the memory limit on overwrite
statusReason: memory limit exceeded
