[Killed] ArithmeticOperator
src/store.ts:292:9
     }
     const approxBytes = Buffer.byteLength(key, 'utf8') + serializedBytes + ENTRY_OVERHEAD_BYTES;
     const oldBytes = this.entries.get(key)?.approxBytes ?? 0;
-    if (this.approxMemoryBytes + approxBytes - oldBytes > this.config.maxMemoryBytes) {
+    if (this.approxMemoryBytes + approxBytes + oldBytes > this.config.maxMemoryBytes) {
       throw new DomainError(ErrorCode.MemoryLimitExceeded, 'memory limit exceeded');
     }
killedBy: KeyValueStore mutation hardening subtracts replaced bytes when checking the memory limit on overwrite
statusReason: memory limit exceeded

[Killed] EqualityOperator
src/store.ts:292:9
     }
     const approxBytes = Buffer.byteLength(key, 'utf8') + serializedBytes + ENTRY_OVERHEAD_BYTES;
     const oldBytes = this.entries.get(key)?.approxBytes ?? 0;
-    if (this.approxMemoryBytes + approxBytes - oldBytes > this.config.maxMemoryBytes) {
+    if (this.approxMemoryBytes + approxBytes - oldBytes <= this.config.maxMemoryBytes) {
       throw new DomainError(ErrorCode.MemoryLimitExceeded, 'memory limit exceeded');
     }
killedBy: KeyValueStore mutation hardening enforces the maximum TTL boundary at exactly 2592000 seconds
statusReason: memory limit exceeded

[Killed] ConditionalExpression
src/store.ts:295:9
     if (this.approxMemoryBytes + approxBytes - oldBytes > this.config.maxMemoryBytes) {
       throw new DomainError(ErrorCode.MemoryLimitExceeded, 'memory limit exceeded');
     }
-    if (ttlSeconds === undefined) {
+    if (false) {
       return { approxBytes, expiresAtNanos: null, expiresAtDate: null };
     }
killedBy: HTTP API rejects invalid keys on POST /expire with 400 INVALID_KEY, not 404
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] EqualityOperator
src/store.ts:295:9
     if (this.approxMemoryBytes + approxBytes - oldBytes > this.config.maxMemoryBytes) {
       throw new DomainError(ErrorCode.MemoryLimitExceeded, 'memory limit exceeded');
     }
-    if (ttlSeconds === undefined) {
+    if (ttlSeconds !== undefined) {
       return { approxBytes, expiresAtNanos: null, expiresAtDate: null };
     }
killedBy: KeyValueStore mutation hardening enforces the maximum TTL boundary at exactly 2592000 seconds
statusReason: expected undefined to be defined

[Killed] ArithmeticOperator
src/store.ts:300:41
     }
     return {
       approxBytes,
-      expiresAtNanos: this.nowNanos() + BigInt(ttlSeconds) * NANOS_PER_SECOND,
+      expiresAtNanos: this.nowNanos() + BigInt(ttlSeconds) / NANOS_PER_SECOND,
       expiresAtDate: new Date(Date.now() + ttlSeconds * 1000)
     };
killedBy: KeyValueStore mutation hardening reports ttl -2 for missing, -1 for no-expiry, and a positive value for a live ttl
statusReason: expected -2 to be greater than 0

[Killed] ArithmeticOperator
src/store.ts:300:23
     }
     return {
       approxBytes,
-      expiresAtNanos: this.nowNanos() + BigInt(ttlSeconds) * NANOS_PER_SECOND,
+      expiresAtNanos: this.nowNanos() - BigInt(ttlSeconds) * NANOS_PER_SECOND,
       expiresAtDate: new Date(Date.now() + ttlSeconds * 1000)
     };
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 404 "Not Found"

[Survived] ArithmeticOperator
src/store.ts:301:44
     return {
       approxBytes,
       expiresAtNanos: this.nowNanos() + BigInt(ttlSeconds) * NANOS_PER_SECOND,
-      expiresAtDate: new Date(Date.now() + ttlSeconds * 1000)
+      expiresAtDate: new Date(Date.now() + ttlSeconds / 1000)
     };
   }

[Survived] ArithmeticOperator
src/store.ts:301:31
     return {
       approxBytes,
       expiresAtNanos: this.nowNanos() + BigInt(ttlSeconds) * NANOS_PER_SECOND,
-      expiresAtDate: new Date(Date.now() + ttlSeconds * 1000)
+      expiresAtDate: new Date(Date.now() - ttlSeconds * 1000)
     };
   }

[Killed] BlockStatement
src/store.ts:305:61
     };
   }
 
-  private validStoredKey(key: string, now: bigint): boolean {
-    const entry = this.entries.get(key);
-    if (entry === undefined) {
-      return false;
-    }
-    if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {
-      this.removeKey(key);
-      this.expiredKeysRemoved += 1;
-      return false;
-    }
-    return true;
-  }
+  private validStoredKey(key: string, now: bigint): boolean {}
 
   private removeExpired(now: bigint): void {
killedBy: KeyValueStore mutation hardening allows overwriting an existing key at the key limit but rejects a new key
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/store.ts:307:30
 
   private validStoredKey(key: string, now: bigint): boolean {
     const entry = this.entries.get(key);
-    if (entry === undefined) {
-      return false;
-    }
+    if (entry === undefined) {}
     if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {
       this.removeKey(key);
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected 200 "OK", got 400 "Bad Request"

[Killed] BooleanLiteral
src/store.ts:308:14
   private validStoredKey(key: string, now: bigint): boolean {
     const entry = this.entries.get(key);
     if (entry === undefined) {
-      return false;
+      return true;
     }
     if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {
killedBy: KeyValueStore mutation hardening treats a key as expired at the exact expiry instant
statusReason: expected -1 to be -2 // Object.is equality

[Killed] BlockStatement
src/store.ts:310:71
     if (entry === undefined) {
       return false;
     }
-    if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {
-      this.removeKey(key);
-      this.expiredKeysRemoved += 1;
-      return false;
-    }
+    if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {}
     return true;
   }
killedBy: KeyValueStore mutation hardening treats a key as expired at the exact expiry instant
statusReason: expected { key: 'k', value: 'v', …(2) } to be null

[Killed] EqualityOperator
src/store.ts:310:42
     if (entry === undefined) {
       return false;
     }
-    if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {
+    if (entry.expiresAtNanos !== null && entry.expiresAtNanos > now) {
       this.removeKey(key);
       this.expiredKeysRemoved += 1;
killedBy: KeyValueStore mutation hardening treats a key as expired at the exact expiry instant
statusReason: expected { key: 'k', value: 'v', …(2) } to be null

[Survived] AssignmentOperator
src/store.ts:312:7
     }
     if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {
       this.removeKey(key);
-      this.expiredKeysRemoved += 1;
+      this.expiredKeysRemoved -= 1;
       return false;
     }

[Survived] BooleanLiteral
src/store.ts:313:14
     if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {
       this.removeKey(key);
       this.expiredKeysRemoved += 1;
-      return false;
+      return true;
     }
     return true;

[Killed] BlockStatement
src/store.ts:318:44
     return true;
   }
 
-  private removeExpired(now: bigint): void {
-    for (const [key, entry] of this.entries) {
-      if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {
-        this.removeKey(key);
-        this.expiredKeysRemoved += 1;
-      }
-    }
-  }
+  private removeExpired(now: bigint): void {}
 
   private removeKey(key: string): void {
killedBy: KeyValueStore health() rate-limits its expired-key sweep but still converges to accurate counts
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/store.ts:319:46
   }
 
   private removeExpired(now: bigint): void {
-    for (const [key, entry] of this.entries) {
-      if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {
-        this.removeKey(key);
-        this.expiredKeysRemoved += 1;
-      }
-    }
+    for (const [key, entry] of this.entries) {}
   }
 
killedBy: KeyValueStore health() rate-limits its expired-key sweep but still converges to accurate counts
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/store.ts:320:11
 
   private removeExpired(now: bigint): void {
     for (const [key, entry] of this.entries) {
-      if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {
+      if (true) {
         this.removeKey(key);
         this.expiredKeysRemoved += 1;
killedBy: KeyValueStore mutation hardening allows overwriting an existing key at the key limit but rejects a new key
statusReason: expected function to throw STORE_FULL

[Killed] ConditionalExpression
src/store.ts:320:11
 
   private removeExpired(now: bigint): void {
     for (const [key, entry] of this.entries) {
-      if (entry.expiresAtNanos !== null && entry.expiresAtNanos <= now) {
+      if (true && entry.expiresAtNanos <= now) {
         this.removeKey(key);
         this.expiredKeysRemoved += 1;
killedBy: KeyValueStore mutation hardening allows overwriting an existing key at the key limit but rejects a new key
statusReason: expected function to throw STORE_FULL

[Killed] BlockStatement
src/store.ts:327:40
     }
   }
 
-  private removeKey(key: string): void {
-    const entry = this.entries.get(key);
-    if (entry !== undefined) {
-      this.approxMemoryBytes = Math.max(0, this.approxMemoryBytes - entry.approxBytes);
-      this.entries.delete(key);
-    }
-  }
+  private removeKey(key: string): void {}
 
   private view(key: string, entry: StoredEntry, now: bigint): EntryView {
killedBy: KeyValueStore hides expired keys and keeps delete idempotent
statusReason: expected [ 'session:1', 'user:1' ] to deeply equal []

[Killed] ConditionalExpression
src/store.ts:329:9
 
   private removeKey(key: string): void {
     const entry = this.entries.get(key);
-    if (entry !== undefined) {
+    if (false) {
       this.approxMemoryBytes = Math.max(0, this.approxMemoryBytes - entry.approxBytes);
       this.entries.delete(key);
killedBy: KeyValueStore hides expired keys and keeps delete idempotent
statusReason: expected [ 'session:1', 'user:1' ] to deeply equal []

[Killed] BlockStatement
src/store.ts:329:30
 
   private removeKey(key: string): void {
     const entry = this.entries.get(key);
-    if (entry !== undefined) {
-      this.approxMemoryBytes = Math.max(0, this.approxMemoryBytes - entry.approxBytes);
-      this.entries.delete(key);
-    }
+    if (entry !== undefined) {}
   }
 
killedBy: KeyValueStore hides expired keys and keeps delete idempotent
statusReason: expected [ 'session:1', 'user:1' ] to deeply equal []

[Survived] MethodExpression
src/store.ts:330:32
   private removeKey(key: string): void {
     const entry = this.entries.get(key);
     if (entry !== undefined) {
-      this.approxMemoryBytes = Math.max(0, this.approxMemoryBytes - entry.approxBytes);
+      this.approxMemoryBytes = Math.min(0, this.approxMemoryBytes - entry.approxBytes);
       this.entries.delete(key);
     }

[Survived] ArithmeticOperator
src/store.ts:330:44
   private removeKey(key: string): void {
     const entry = this.entries.get(key);
     if (entry !== undefined) {
-      this.approxMemoryBytes = Math.max(0, this.approxMemoryBytes - entry.approxBytes);
+      this.approxMemoryBytes = Math.max(0, this.approxMemoryBytes + entry.approxBytes);
       this.entries.delete(key);
     }

[Killed] BlockStatement
src/store.ts:335:73
     }
   }
 
-  private view(key: string, entry: StoredEntry, now: bigint): EntryView {
-    return {
-      key,
-      value: cloneJson(entry.value),
-      ttlSeconds: entry.expiresAtNanos === null ? null : remainingSeconds(entry.expiresAtNanos, now),
-      expiresAt: entry.expiresAtDate?.toISOString() ?? null
-    };
-  }
+  private view(key: string, entry: StoredEntry, now: bigint): EntryView {}
 }
 
killedBy: KeyValueStore sets, gets, replaces ttl, and persists entries
statusReason: expected undefined to deeply equal { n: 1 }

[Killed] ObjectLiteral
src/store.ts:336:12
   }
 
   private view(key: string, entry: StoredEntry, now: bigint): EntryView {
-    return {
-      key,
-      value: cloneJson(entry.value),
-      ttlSeconds: entry.expiresAtNanos === null ? null : remainingSeconds(entry.expiresAtNanos, now),
-      expiresAt: entry.expiresAtDate?.toISOString() ?? null
-    };
+    return {};
   }
 }
killedBy: KeyValueStore sets, gets, replaces ttl, and persists entries
statusReason: expected undefined to deeply equal { n: 1 }

[Killed] ConditionalExpression
src/store.ts:339:19
     return {
       key,
       value: cloneJson(entry.value),
-      ttlSeconds: entry.expiresAtNanos === null ? null : remainingSeconds(entry.expiresAtNanos, now),
+      ttlSeconds: true ? null : remainingSeconds(entry.expiresAtNanos, now),
       expiresAt: entry.expiresAtDate?.toISOString() ?? null
     };
killedBy: KeyValueStore sets, gets, replaces ttl, and persists entries
statusReason: actual value must be number or bigint, received "object"

[Killed] ConditionalExpression
src/store.ts:339:19
     return {
       key,
       value: cloneJson(entry.value),
-      ttlSeconds: entry.expiresAtNanos === null ? null : remainingSeconds(entry.expiresAtNanos, now),
+      ttlSeconds: false ? null : remainingSeconds(entry.expiresAtNanos, now),
       expiresAt: entry.expiresAtDate?.toISOString() ?? null
     };
killedBy: KeyValueStore sets, gets, replaces ttl, and persists entries
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] OptionalChaining
src/store.ts:340:18
       key,
       value: cloneJson(entry.value),
       ttlSeconds: entry.expiresAtNanos === null ? null : remainingSeconds(entry.expiresAtNanos, now),
-      expiresAt: entry.expiresAtDate?.toISOString() ?? null
+      expiresAt: entry.expiresAtDate.toISOString() ?? null
     };
   }
killedBy: KeyValueStore sets, gets, replaces ttl, and persists entries
statusReason: Cannot read properties of null (reading 'toISOString')

[Killed] LogicalOperator
src/store.ts:340:18
       key,
       value: cloneJson(entry.value),
       ttlSeconds: entry.expiresAtNanos === null ? null : remainingSeconds(entry.expiresAtNanos, now),
-      expiresAt: entry.expiresAtDate?.toISOString() ?? null
+      expiresAt: entry.expiresAtDate?.toISOString() && null
     };
   }
killedBy: KeyValueStore sets, gets, replaces ttl, and persists entries
statusReason: expected undefined to be null

[Killed] BlockStatement
src/store.ts:345:48
   }
 }
 
-function validateTtl(ttlSeconds: number): void {
-  if (!Number.isInteger(ttlSeconds) || ttlSeconds <= 0 || ttlSeconds > MAX_TTL_SECONDS) {
-    throw new DomainError(ErrorCode.InvalidTtl, 'ttlSeconds must be between 1 and 2592000');
-  }
-}
+function validateTtl(ttlSeconds: number): void {}
 
 function remainingSeconds(expiresAt: bigint, now: bigint): number {
killedBy: KeyValueStore mutation hardening enforces the maximum TTL boundary at exactly 2592000 seconds
statusReason: expected function to throw INVALID_TTL

[Killed] BlockStatement
src/store.ts:346:89
 }
 
 function validateTtl(ttlSeconds: number): void {
-  if (!Number.isInteger(ttlSeconds) || ttlSeconds <= 0 || ttlSeconds > MAX_TTL_SECONDS) {
-    throw new DomainError(ErrorCode.InvalidTtl, 'ttlSeconds must be between 1 and 2592000');
-  }
+  if (!Number.isInteger(ttlSeconds) || ttlSeconds <= 0 || ttlSeconds > MAX_TTL_SECONDS) {}
 }
 
killedBy: KeyValueStore validates key, ttl, value size, and duplicate mset keys
statusReason: expected function to throw INVALID_TTL

[Killed] LogicalOperator
src/store.ts:346:7
 }
 
 function validateTtl(ttlSeconds: number): void {
-  if (!Number.isInteger(ttlSeconds) || ttlSeconds <= 0 || ttlSeconds > MAX_TTL_SECONDS) {
+  if (!Number.isInteger(ttlSeconds) && ttlSeconds <= 0 || ttlSeconds > MAX_TTL_SECONDS) {
     throw new DomainError(ErrorCode.InvalidTtl, 'ttlSeconds must be between 1 and 2592000');
   }
killedBy: KeyValueStore validates key, ttl, value size, and duplicate mset keys
statusReason: expected function to throw INVALID_TTL

[Killed] BlockStatement
src/store.ts:351:67
   }
 }
 
-function remainingSeconds(expiresAt: bigint, now: bigint): number {
-  const remaining = (expiresAt - now) / NANOS_PER_SECOND;
-  return Number(remaining < 0n ? 0n : remaining);
-}
+function remainingSeconds(expiresAt: bigint, now: bigint): number {}
 
 function cloneJson(value: JsonValue): JsonValue {
killedBy: KeyValueStore sets, gets, replaces ttl, and persists entries
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ArithmeticOperator
src/store.ts:352:21
 }
 
 function remainingSeconds(expiresAt: bigint, now: bigint): number {
-  const remaining = (expiresAt - now) / NANOS_PER_SECOND;
+  const remaining = (expiresAt - now) * NANOS_PER_SECOND;
   return Number(remaining < 0n ? 0n : remaining);
 }
killedBy: KeyValueStore mutation hardening reports ttl -2 for missing, -1 for no-expiry, and a positive value for a live ttl
statusReason: expected 100000000000000000000 to be less than or equal to 100

[Survived] ArithmeticOperator
src/store.ts:352:22
 }
 
 function remainingSeconds(expiresAt: bigint, now: bigint): number {
-  const remaining = (expiresAt - now) / NANOS_PER_SECOND;
+  const remaining = (expiresAt + now) / NANOS_PER_SECOND;
   return Number(remaining < 0n ? 0n : remaining);
 }

[Killed] ConditionalExpression
src/store.ts:353:17
 
 function remainingSeconds(expiresAt: bigint, now: bigint): number {
   const remaining = (expiresAt - now) / NANOS_PER_SECOND;
-  return Number(remaining < 0n ? 0n : remaining);
+  return Number(true ? 0n : remaining);
 }
 
killedBy: KeyValueStore mutation hardening reports ttl -2 for missing, -1 for no-expiry, and a positive value for a live ttl
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/store.ts:353:17
 
 function remainingSeconds(expiresAt: bigint, now: bigint): number {
   const remaining = (expiresAt - now) / NANOS_PER_SECOND;
-  return Number(remaining < 0n ? 0n : remaining);
+  return Number(remaining >= 0n ? 0n : remaining);
 }
 
killedBy: KeyValueStore mutation hardening reports ttl -2 for missing, -1 for no-expiry, and a positive value for a live ttl
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/store.ts:356:49
   return Number(remaining < 0n ? 0n : remaining);
 }
 
-function cloneJson(value: JsonValue): JsonValue {
-  return JSON.parse(JSON.stringify(value)) as JsonValue;
-}
+function cloneJson(value: JsonValue): JsonValue {}
 
killedBy: HTTP API supports set, get, mget, keys, and health envelopes
statusReason: expected undefined to deeply equal { ok: true }
